{"text": "facial recognition - biometric"}
{"text": "federated learning"}
{"text": "location"}
{"text": "1"}
{"text": "VACANT POSITIONS"}
{"text": "The National Social Security Fund has service delivery points spread across the country"}
{"text": "and is seeking to enhance capacity of its human resource to achieve its obligations of"}
{"text": "service delivery to all Kenyans. The Fund seeks to recruit experienced and energetic"}
{"text": "Kenyans to fill these vacancies from the positions as outlined below:"}
{"text": "ASSISTANT MANAGER, LEGAL AND REGULATORY SERVICES (MG4)"}
{"text": "Reporting to the Manager (Legal and Regulatory Services), he/she will be responsible for"}
{"text": "preparing legal opinion and advice on general issues that may arise."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Formulate and review the Fund’s legal strategies, policies, processes and"}
{"text": "procedures;"}
{"text": "• Provide and interpret legal opinions and advise on legal issues that may arise from"}
{"text": "time to time;"}
{"text": "• Receive summons, review the relevant files and prepare suitable instructions to"}
{"text": "external lawyers;"}
{"text": "• Review all court documents prepared by external lawyers;"}
{"text": "• Correspond with external lawyers/advocates on all the issues that may arise and"}
{"text": "advise on the position of the Fund;"}
{"text": "• Vet and draft legal agreements;"}
{"text": "• Ensure proper and safe custody of all legal documentation; and"}
{"text": "• Represent the Fund in all legal proceedings, coordinating, preparations, filing and"}
{"text": "service of pleadings."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor of Laws Degree from a recognized institution;"}
{"text": "• Master of Laws Degree or Social Sciences from a recognized institution as an added"}
{"text": "advantage;"}
{"text": "• Postgraduate Diploma in Legal Studies from the Council for Legal Education;"}
{"text": "• Admitted as an advocate of the High Court of Kenya;"}
{"text": "• Membership to a relevant and accredited professional body such as the Law Society"}
{"text": "of Kenya (LSK) and/or Institute of Certified Secretaries (ICS) and in good standing;"}
{"text": "• At least ten (10) years relevant cumulative work experience, three (3) of which should"}
{"text": "have been at a supervisory position;"}
{"text": "• Management course from a recognized institution;"}
{"text": "• Proficiency in computer applications."}
{"text": "2"}
{"text": "ASSISTANT MANAGER, CORPORATE COMMUNICATIONS (MG4)"}
{"text": "Reporting to the Manager (Corporate Communication) he/she will be responsible for"}
{"text": "Overseeing implementation of publicity strategies and campaigns and preparation of"}
{"text": "media press releases."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Organize media briefings, Broadcast interviews, Press conferences on current Fund"}
{"text": "affairs;"}
{"text": "• Analyze media coverage in regard to NSSF’s targeted audience;"}
{"text": "• Implement customer satisfaction survey recommendations;"}
{"text": "• Supervise the production of content for internal publication from contracted service"}
{"text": "providers;"}
{"text": "• Write and review proposals for Corporate Social Responsibility events;"}
{"text": "• Develop customized promotional messages for publicity and advertisement;"}
{"text": "• Analyze and monitor customer complaints lodged and developing customer value"}
{"text": "proposition strategies for handling of customer complaints effectively; and"}
{"text": "• Implement the Fund’s customer service charter and implement and monitor the"}
{"text": "communication policy."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Communications, Public"}
{"text": "Relations, Journalism or related field from a recognized institution;"}
{"text": "• Master’s Degree in any of the following disciplines: Communications, Public"}
{"text": "Relations, Journalism or related field from a recognized institution is an added"}
{"text": "advantage;"}
{"text": "• Professional Qualification in any of the following disciplines: Communications, Public"}
{"text": "Relations, Journalism or related field from a recognized institution;"}
{"text": "• At least ten (10) years’ work experience, three (3) of which should be in a supervisory"}
{"text": "position;"}
{"text": "• Membership to a professional accredited body related to Communications, Public"}
{"text": "Relations or Journalism or other related field, such as the Public Relations Society of"}
{"text": "Kenya (PRSK), International Association of Business Communicators (IABC) and in"}
{"text": "good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, ETHICS & INTEGRITY (MG4)"}
{"text": "Reporting to the Manager, Ethics & Integrity he/she will be responsible for Coordinating"}
{"text": "the preparation of comprehensive reports and ad hoc briefs pertaining to complex"}
{"text": "investigations and, based on analysis and findings, make recommendations for corrective"}
{"text": "actions, improved controls and efficiency of NSSF operations."}
{"text": "3"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Participate in formulation and review of the Fund’s investigation strategies, policies,"}
{"text": "processes and procedures;"}
{"text": "• Assess the potential for fraud and corruption in operational activities and making"}
{"text": "recommendations for senior management decisions;"}
{"text": "• Effectively work, collaborate and coordinate with other control and monitoring"}
{"text": "functions as appropriate;"}
{"text": "• Oversee training and sensitizing staff and other stakeholders on ethics and corruption"}
{"text": "prevention;"}
{"text": "• Oversee corruption risk assessments and preparing corruption mitigation plans;"}
{"text": "• Coordinate and train staff on the two-year wealth declarations;"}
{"text": "• Coordinate corruption prevention committees (CPCs);"}
{"text": "• Efficiently coordinate and undertake office and field-based complex; and"}
{"text": "• Investigate into allegations of violations of policies, procedures, standards, guidelines,"}
{"text": "and applicable rules and regulations."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Law, Finance, Business Management or a related field from a"}
{"text": "recognized institution;"}
{"text": "• Master’s Degree in Law, Finance, Business Management or a related field from a"}
{"text": "recognized institution is an added advantage."}
{"text": "• Professional qualification in any of the following disciplines: Law, Finance, Business"}
{"text": "Management or a related field from a recognized institution;"}
{"text": "• At least ten (10) years relevant cumulative work experience, three (3) of which should"}
{"text": "have been at a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, REGISTRATION & COMPLIANCE (MG4)"}
{"text": "Reporting to the Manager, Registration & Compliance he/she will be responsible for"}
{"text": "analyzing inspection reports from field offices, employer files and system compliance"}
{"text": "reports for correspondence with field offices."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Analyze Inspection Reports from field offices, employer files and system compliance"}
{"text": "reports for correspondence with field offices;"}
{"text": "• Ensure follow-up on customer enquiries and complaints;"}
{"text": "• Oversee preparation of periodic departmental and field operation reports as well as"}
{"text": "inter departmental and external correspondences;"}
{"text": "• Carry out quality assurance audits in the field offices;"}
{"text": "• Undertake/participate in the implementation of departmental projects/committees and"}
{"text": "update the registration and collections manager;"}
{"text": "• Carry out performance analysis and document reviews for target setting;"}
{"text": "4"}
{"text": "• Review Key Performance Indicators, targets in conjunction with Branch and Regional"}
{"text": "offices; and"}
{"text": "• Participate in member education forums periodically."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Social Sciences, Business"}
{"text": "Administration, Law, Public Relations, Marketing or related field from a recognized"}
{"text": "institution;"}
{"text": "• Master’s Degree in any of the following disciplines: Social Sciences, Business"}
{"text": "Administration, Law, Public Relations, Marketing or related field from a recognized"}
{"text": "institution is an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Social Sciences, Business"}
{"text": "Administration, Law, Public Relations, Marketing or related field from a recognized"}
{"text": "institution;"}
{"text": "• At least ten (10) years’ relevant cumulative work experience, three (3) of which should"}
{"text": "be in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, ICT (MG4)"}
{"text": "Reporting to the Manager, ICT, he/she will be responsible for Implementing IT project"}
{"text": "solutions for user departments."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Develop overall change management on technological adoption;"}
{"text": "• Research emerging Information Technology to be adopted;"}
{"text": "• Formulate innovative solutions to the business;"}
{"text": "• Verify proposed solutions and communicating to the users;"}
{"text": "• Coordinate between functional users’ requests and the solution providers;"}
{"text": "• Develop policies and procedures, within company guidelines, for the IT unit and"}
{"text": "providing guidance in the interpretation and implementation of these;"}
{"text": "• Continuously review and improve customer service and quality assurance policies,"}
{"text": "procedures and processes;"}
{"text": "• Ensure the integration of processes to maintain and develop the required services to"}
{"text": "support and improve effectiveness of the core activities;"}
{"text": "• Translate business practices and processes into architectures to enable delivery of"}
{"text": "appropriate solutions;"}
{"text": "• Review network configuration and planning cost-effective upgrades to keep up with"}
{"text": "changing technology, growth and needs of Fund’s components;"}
{"text": "• Conduct research and make recommendations on network products, services,"}
{"text": "protocols, and standards in support of network procurement and development efforts;"}
{"text": "• Formulate and implement Information Security Section policies and procedures and"}
{"text": "ensuring compliance with IT security policy;"}
{"text": "5"}
{"text": "• Oversee the installation, testing and implementation of applications and databases;"}
{"text": "• Coordinate the day-to-day administration of systems and user IDs including creation,"}
{"text": "deletion, modification, resets or extensions and roles assignment; and"}
{"text": "• Conduct information risk assessments to identify gaps and give solutions to mitigate"}
{"text": "security incidents and breaches."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Computer Science, Information Technology or related field from"}
{"text": "a recognized institution;"}
{"text": "• Masters’ Degree in Computer Science, Information Technology or related field from a"}
{"text": "recognized institution is an added advantage;"}
{"text": "• Professional qualification such as CISA, MCSE, CCNA, CCNP, CCIE, CNE or any"}
{"text": "other relevant qualification from a recognized institution;"}
{"text": "• At least ten (10) years’ work experience three (3) of which should be in a supervisory"}
{"text": "role;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing; and"}
{"text": "• Management course from a recognized institution;"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, HUMAN RESOURCE (MG4)"}
{"text": "Reporting to the Manager, Human Resource. He/she will be responsible for Formulating"}
{"text": "and ensuring implementation of leading human resource strategies and practices in their"}
{"text": "respective section."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Identify the resources and skills needed to deliver on the strategic plan and leading"}
{"text": "the acquisition of those skills through recruitment, training, and employee career"}
{"text": "management;"}
{"text": "• Ensure performance appraisals are conducted and the appraisal outputs and"}
{"text": "resolutions are implemented;"}
{"text": "• Analyze recruitment requests against the Establishment Plan and ensure the"}
{"text": "maintenance of the approved staff complement;"}
{"text": "• Prepare training plan for the organization in accordance with the identified training"}
{"text": "needs."}
{"text": "• Propose and seek for approval of the training budget;"}
{"text": "• Constitute Joint Industrial Committees to deliberate on arising industrial issues to"}
{"text": "enhance good industrial relations;"}
{"text": "• Ensure that disciplinary and grievance procedures are followed and participating in"}
{"text": "the disciplinary and grievance processes;"}
{"text": "• Ensure occupational Health and Safety measure are in place and are followed;"}
{"text": "• Oversee the effective management of the payroll, Staff Medical Scheme, Staff Loans"}
{"text": "Scheme and Staff Insurances;"}
{"text": "• Ensure adherence to the defined culture by modelling the appropriate behavior"}
{"text": "required to meet human resource demands and performance expectations;"}
{"text": "6"}
{"text": "• Ensure collaboration amongst the staff with other Departments and relevant"}
{"text": "stakeholders for the purpose of cultivating collective responsibility to achieve Fund’s"}
{"text": "objective; and"}
{"text": "• Ensure that recognized, approved and correct benefits and allowances are processed"}
{"text": "and any necessary recovery made in line with policy and legislation."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines; Human Resource Management,"}
{"text": "Business Administration, Social Sciences or a related field from a recognized"}
{"text": "Institution;"}
{"text": "• Master’s Degree in any of the following disciplines; Human Resource Management,"}
{"text": "Business Administration, Social Sciences or a related field from a recognized"}
{"text": "institution is an added advantage;"}
{"text": "• Professional qualification in Human Resource management, such as CHRP (K) or its"}
{"text": "equivalent from a recognized institution;"}
{"text": "• At least ten (10) years’ work experience, three (3) of which should be in a supervisory"}
{"text": "position;"}
{"text": "• Membership in a relevant and accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, SUPPLY CHAIN MANAGEMENT (MG4)"}
{"text": "Reporting to the Manager, Supply Chain Management, he/she will be responsible for"}
{"text": "Implementing the procurement processes and procedures to ensure they are in line with"}
{"text": "the Public Procurement and Asset Disposal Act 2015 and the attendant regulations."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Oversee stock control and order processing;"}
{"text": "• Ensure stock control systems are updated;"}
{"text": "• Ensure delivery, quality, cost and environmental objectives are met;"}
{"text": "• Plan future capacity requirements;"}
{"text": "• Produce regular reports;"}
{"text": "• Coordinate stock taking;"}
{"text": "• Review and approve purchase orders as per approved limits;"}
{"text": "• Coordinate the tendering process i.e. Prepare tender document and tender Adverts;"}
{"text": "and"}
{"text": "• Ensure the stores have adequate supplies for users’ needs."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s degree in Procurement, Commerce, Economics, Finance or related Field"}
{"text": "from a recognized institution;"}
{"text": "• Master’s degree in Procurement, Commerce, Economics, Finance or related field from"}
{"text": "a recognized institution is an added advantage;"}
{"text": "• Professional qualification in procurement or a related discipline;"}
{"text": "7"}
{"text": "• At least ten (10) years’ work experience, three (3) years of which should be in a"}
{"text": "supervisory position;"}
{"text": "• Membership to KISM and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, RISK MANAGEMENT (MG4)"}
{"text": "The Assistant Manager, Risk Management will be reporting to the Manager, Strategy,"}
{"text": "Planning & Corporate Performance. He/she will be responsible for Plan the risk"}
{"text": "assessments comprising of preliminary surveys of processes to be reviewed, evaluation"}
{"text": "of applicable Risk Management frameworks, protocols, policies and procedures,"}
{"text": "development of risk assessment templates."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Prepare the annual risk plan;"}
{"text": "• Coordinate and conduct risk and control self-assessment to ensure conformity with"}
{"text": "the Enterprise Risk Management Framework and other policies;"}
{"text": "• Participate in the review of risk assessment reports;"}
{"text": "• Organize management meetings to discuss the observations, risk exposures and"}
{"text": "recommendations;"}
{"text": "• Review and prepare the final risk assessment report, incorporating any revisions"}
{"text": "resulting from the management discussions;"}
{"text": "• Conduct continuous risk assessments and generation of risk sensitization memos;"}
{"text": "• Facilitate the preparation of the Fund's risk register and evaluating the risks in relation"}
{"text": "to agreed criteria and maintaining the register based on the Enterprise Risk"}
{"text": "Management, Business Continuity and Information Security Frameworks;"}
{"text": "• Follow up on and track the progress of remediation of risk and control weaknesses"}
{"text": "identified by Risk Assessment, Internal Audit, self-testing, or controls assessment;"}
{"text": "and"}
{"text": "• Provide support, education and training to staff on emerging issues in Risk"}
{"text": "Management and Compliance."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor's Degree in Finance, Economics, Statistics, Actuarial Science, Project"}
{"text": "Management, Business Administration or any other relevant qualification from a"}
{"text": "recognized institution;"}
{"text": "• Master’s Degree in Finance, Economics, Statistics, Actuarial Science, Project"}
{"text": "Management, Business Administration or any other relevant qualification from a"}
{"text": "recognized institution as an added advantage;"}
{"text": "• Professional qualification such as CIA, CISA, ACCA, CPA (K), CRMA, PRM, FSA,"}
{"text": "CERA or equivalent from a recognized institution;"}
{"text": "• At least ten (10) years’ work experience, three (3) of which should be in a supervisory"}
{"text": "position;"}
{"text": "8"}
{"text": "• Membership to a relevant and accredited professional body such as ICPAK, IIA,"}
{"text": "ISACA, SoA, IFoA, ACCA, TASK or any other relevant qualification and in good"}
{"text": "standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, SECURITY (MG4)"}
{"text": "Reporting to the Manager (Security)he/she will be responsible for overseeing protection"}
{"text": "of the Fund’s property, office premises and assets, both developed and undeveloped."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Coordinate training of staff and other stakeholders on Safety, Health and Security"}
{"text": "awareness;"}
{"text": "• Carryout security audits of the Fund’s commercial properties;"}
{"text": "• Prepare and forward investigation reports to Manager, Security;"}
{"text": "• Oversee spot checks to assess/evaluate the performance of contracted security"}
{"text": "service providers;"}
{"text": "• Coordinate surveillance on the Fund’s undeveloped properties;"}
{"text": "• Gather intelligence on potential security threats to the Fund’s assets and personnel;"}
{"text": "• Report criminal cases and incidents to police and other law enforcement organs for"}
{"text": "further action;"}
{"text": "• Assist in the management of emergency situations; and"}
{"text": "• Organize and Manage Annual Emergency Drills."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Criminology or any security-related field from a recognized"}
{"text": "institution;"}
{"text": "• Master’s Degree in Criminology or any security-related field from a recognized"}
{"text": "institution is an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Criminology, Law or any"}
{"text": "security-related field from a recognized institution;"}
{"text": "• At least ten (10) years relevant cumulative work experience, three (3) of which should"}
{"text": "be in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications from a recognized institution."}
{"text": "ASSISTANT MANAGER, FINANCE"}
{"text": "Reporting to the Manager, Finance, he/she will be responsible for assisting in the"}
{"text": "Preparation, monitoring, controlling and reviewing annual corporate budgets for the Fund"}
{"text": "including re-allocations."}
{"text": "9"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Prepare and analyze expenditure reports;"}
{"text": "• Review invoices for payment;"}
{"text": "• Reconcile accounts e.g. vendor ageing report, treasury and ensuring availability of"}
{"text": "sufficient funds to all bank accounts;"}
{"text": "• Validate and confirm collections received from branches;"}
{"text": "• Issue debit receipts;"}
{"text": "• Maintain cashbook;"}
{"text": "• Prepare periodic Financial Statements and support working papers/schedules;"}
{"text": "• Analyze financial performance for medium and long-term business"}
{"text": "planning/forecasting;"}
{"text": "• Prepare statutory financial reports."}
{"text": "• Reconcile ledgers and bank statements;"}
{"text": "• Maintain fixed assets register;"}
{"text": "• Monitor and evaluate the financial information system"}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s degree in Finance, Accounting, Economics, Commerce or related field"}
{"text": "from a recognized institution;"}
{"text": "• Masters’ degree in Finance, Accounting, Economics, Commerce or related field from"}
{"text": "a recognized institution is an added advantage;"}
{"text": "• Professional qualification such as CPA (K), ACCA and/or CFA; Membership to a"}
{"text": "relevant and accredited professional body such as ICPAK, ACCA and/or the CFA"}
{"text": "Institute and in good standing;"}
{"text": "• At least ten (10) years’ work experience three (3) of which should be in a supervisory"}
{"text": "position;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, ADMINISTRATION (MG4)"}
{"text": "Reporting to the Manager (Administration), he/she will be responsible for assisting in"}
{"text": "coordinating and managing all administration functions In line with the funds administration"}
{"text": "policy."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Oversee and manage office facilities and equipment;"}
{"text": "• Manage hospitality, cleaning and mail services;"}
{"text": "• Manage and coordinate licensing and mail services;"}
{"text": "• Provide administrative support services to the other departments and branches;"}
{"text": "• Initiate identification and disposal of assets;"}
{"text": "• Compile report on the assets identified by teams for disposal to estimate expected"}
{"text": "revenue;"}
{"text": "• Authorize transport schedules and resources to meet the changing demands;"}
{"text": "10"}
{"text": "• Manage vehicles in liaison with the Manager, Administration to determine most"}
{"text": "efficient and effective use, replacement strategy, and ensure compliance with"}
{"text": "legislation and guidelines;"}
{"text": "• Oversee appropriate utilization of vehicles and fuel;"}
{"text": "• Manage the renewal of applicable licenses for Fund’s fleet of motor vehicles;"}
{"text": "• Ensure all Fund vehicles are insured at all times;"}
{"text": "• Authorize valuation of vehicles that are due for replacement and make"}
{"text": "recommendations for purchase to Procurement; and"}
{"text": "• Ensure all contracts with service providers are well managed."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in social sciences or related field from a recognised institution;"}
{"text": "• Master’s Degree in social sciences or related field from a recognised institution is an"}
{"text": "added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: social sciences; Business"}
{"text": "Administration; Public Relations or related field from a recognized institution;"}
{"text": "• At least ten (10) years’ work experience three (3) of which should have been at a"}
{"text": "supervisory position;"}
{"text": "• Management course from a recognized institution;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, BENEFITS (MG4)"}
{"text": "Reporting to the Manager (Benefits), he/she will be responsible for ensuring verification"}
{"text": "of benefits claims to ensure completeness and accuracy of documentation."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Ensure proper receipting of claims from Documentation section, sorting and batching"}
{"text": "for awarding into the system;"}
{"text": "• Coordinate award of claims in system to determine amounts payable and bank details"}
{"text": "of payee(s);"}
{"text": "• Ensure generation of payment information reports and filing in claim files"}
{"text": "appropriately;"}
{"text": "• Oversee examination of payment information details, endorsement and dispatch"}
{"text": "claims in system to Authorization section; and"}
{"text": "• Ensure customer’s enquiries and complaints by Branch Officers/call centre or walk-in"}
{"text": "clients are handled effectively."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Actuarial Science; Social"}
{"text": "Sciences, Business Administration, Law, Public Relations, Marketing or related field"}
{"text": "from a recognized institution;"}
{"text": "11"}
{"text": "• Masters’ Degree in any of the following disciplines: Social Sciences, Business"}
{"text": "Administration, Law, Public Relations, Marketing or related field from a recognized"}
{"text": "institution is an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Social Sciences, Business"}
{"text": "Administration, Public Relations, Marketing or related field from a recognized"}
{"text": "institution;"}
{"text": "• At least ten (10) years’ relevant cumulative work experience, three (3) of which should"}
{"text": "be in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, FINGERPRINTS (MG4)"}
{"text": "Reporting to the Manager, Registration & Compliance he/she will be responsible for"}
{"text": "coordinating classification/searches of fingerprints records for benefit processing."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Ensure proper maintenance of all fingerprint records in the fingerprint bureau;"}
{"text": "• Coordinate fingerprint searches and handles customer complaints from all the"}
{"text": "branches;"}
{"text": "• Assign daily tasks to officers in the Fingerprint Bureau;"}
{"text": "• Handle queries concerning fingerprint searches from all the branches;"}
{"text": "• Handle amendments of names, year of birth, misquoted identity cards on"}
{"text": "member records"}
{"text": "• Ensure prompt customer service delivery to all members who visit the fingerprint"}
{"text": "bureau."}
{"text": "• Respond to customer complaints"}
{"text": "• Provide support to National Registration Bureau"}
{"text": "• Prepare monthly and quarterly reports for the unit."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelors’ Degree in any of the following disciplines: Social Sciences; Business"}
{"text": "Administration; Marketing or related field from a recognized Institution;"}
{"text": "• Masters’ Degree in any of the following disciplines: Social Sciences; Business"}
{"text": "Administration; Marketing or related field from a recognized Institution is an added"}
{"text": "advantage;"}
{"text": "• Professional qualification such as Fingerprints Paper A,B and C; Diploma in"}
{"text": "Fingerprints or equivalent from a recognised institution;"}
{"text": "• At least ten (10) years relevant work experience, three (3) of which should have been"}
{"text": "in a supervisory/ middle level management position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "and"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "12"}
{"text": "ASSISTANT MANAGER, INTERNAL AUDIT (MG4)"}
{"text": "Reporting to the Manager (Internal Audit), he/she will be responsible for Preparing audit"}
{"text": "programs and planning memorandum for individual assignments."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Participate in audit entry and exit discussions;"}
{"text": "• Monitor and review the execution of individual audit assignments;"}
{"text": "• Review final audit reports and preparing the executive summary for individual audit"}
{"text": "reports;"}
{"text": "• Prepare board papers on Internal Audit activities;"}
{"text": "• Develop Annual Audit Plan;"}
{"text": "• Prepare documents for use in Internal Audit and compliance committee of the Board;"}
{"text": "• Undertake special Audit investigations as they may be required from time to time;"}
{"text": "and"}
{"text": "• Interpret Fund's policies for sound audit planning."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor's Degree in Finance, Economics, Statistics, Project Management, Business"}
{"text": "Administration or any other relevant qualification from a recognized institution;"}
{"text": "• Master’s Degree in Finance, Economics, Statistics, Project Management, Business"}
{"text": "Administration or any other relevant qualification from a recognized institution is an"}
{"text": "added advantage;"}
{"text": "• Professional qualification such as CIA, CISA, ACCA, CPA (K), CRMA, PRM or"}
{"text": "equivalent from a recognized institution;"}
{"text": "• At least ten (10) years’ work experience, three (3) of which should have been in a"}
{"text": "supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body such as ICPAK, ACCA"}
{"text": "or any other relevant qualification; and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, INVESTMENTS (MG4)"}
{"text": "Reporting to the Manager, Investments, he/she will be responsible for Coordinating with"}
{"text": "consultants to prepare and/or review policy documents such as Investment Strategy,"}
{"text": "Investment Policy and Interest Declaration and Reserve Allocation Policy;"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Ensure budgets are available for investment purposes;"}
{"text": "• Undertake actuarial valuations and insurance of insurable assets periodically when"}
{"text": "required;"}
{"text": "• Liaise with consultants to coordinate data collection for actuarial valuation; Ensure"}
{"text": "monitoring of the performance of the portfolio, asset allocation and the compliance of"}
{"text": "the same to laws and regulations;"}
{"text": "13"}
{"text": "• Analyze technical specifications for the procurement of investment service providers."}
{"text": "This entails the review of contracts when they fall due; and"}
{"text": "• Coordinate portfolio construction such as asset allocation, identification and analysis"}
{"text": "of new opportunities."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Insurance, Actuarial Science, Accounting, Finance, Economics"}
{"text": "or related fields from a recognized institution;"}
{"text": "• Master’s Degree in Actuarial Science, Accounting, Finance, Economics or related"}
{"text": "fields from a recognized institution is an added advantage;"}
{"text": "• Professional Qualification such as Certified Financial Analyst (CFA), Certified"}
{"text": "Investment and Financial Analyst (CIFA), Fellow of the Society of Actuaries (FSA),"}
{"text": "Fellow of the Institute and Faculty of Actuaries, Certification in Insurance or any other"}
{"text": "relevant qualification;"}
{"text": "• At least ten (10) years’ relevant cumulative work experience, three (3) of which should"}
{"text": "have been in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, PROPERTY DEVELOPMENT (MG4)"}
{"text": "Reporting to the Manager (Property Development) he/she will be responsible for"}
{"text": "Coordinating the preparation of plans, layouts, designs, reports and cost estimates for"}
{"text": "budgeting and property development purposes and for proposed routine maintenance"}
{"text": "works and new projects, either in house or in liaison with consultants and contractors."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Evaluate performance standards for consultants and contractors for on-going projects"}
{"text": "and advise management on appropriate action;"}
{"text": "• Evaluate and analyze tender and project scheduling and monitoring;"}
{"text": "• Inspect and accept completed projects;"}
{"text": "• Attend site meetings to evaluate project progress;"}
{"text": "• Pursue statutory approvals in conjunction with project consultants;"}
{"text": "• Perform project hand-over inspections and sign-off; and"}
{"text": "• Prepare designs and supervise office sites for Branch/Regional offices when required."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Architecture, Quantity Survey,"}
{"text": "Construction, Civil Engineering, Electrical Engineering or related field from a"}
{"text": "recognized institution;"}
{"text": "• Master’s Degree in any of the following disciplines: Architecture, Quantity Survey,"}
{"text": "Construction, Civil Engineering, Electrical Engineering or related field from a"}
{"text": "recognized institution is an added advantage;"}
{"text": "14"}
{"text": "• Professional Qualification in any of the following disciplines: Architecture, Quantity"}
{"text": "Survey, Construction, Civil Engineering, Electrical Engineering or related field from a"}
{"text": "recognized institution;"}
{"text": "• At least ten (10) years relevant work experience, three (3) of which should be in a"}
{"text": "supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Management Course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, PROPERTY MANAGEMENT (MG4)"}
{"text": "Reporting to the Manager Property Management, he/she will be responsible for"}
{"text": "Developing policy guidelines on all matters related to management of the Funds’"}
{"text": "properties"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Verify bid documents and targets for the property management agents’ rental levels,"}
{"text": "maintenance and general procedures;"}
{"text": "• Ensure preparation of applications for prospective tenants fronted by the Property"}
{"text": "agents;"}
{"text": "• Liaise with agents to ensure that they advertise and rent out the Fund’s properties;"}
{"text": "• Oversee service providers’ contracts;"}
{"text": "• Coordinate monthly inspections of the buildings with the property management"}
{"text": "agents;"}
{"text": "• Ensure forwarding of valuation requests and relevant documentation to the"}
{"text": "Chief Government Valuer and independent valuers;"}
{"text": "• Analyze Management reports for all Fund properties and maintain all relevant"}
{"text": "logs records and information relating to the properties required;"}
{"text": "• Ensure conflicts between tenants and the managing agents are resolved;"}
{"text": "• Ensure the Fund properties adhere to all statutory regulations;"}
{"text": "• Administer leases for the Fund Commercial buildings and lease offices."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Land Economics, Real Estate, Construction, Planning, Civil"}
{"text": "Engineering, Electrical Engineering or related field from a recognized institution;"}
{"text": "• Master’s Degree in Land Economics, Real Estate, Construction, Planning, Civil"}
{"text": "Engineering, Electrical Engineering or related field from a recognized institution;"}
{"text": "• Professional Qualification in any of the following disciplines: Land Economics, Real"}
{"text": "Estate, Construction, Planning, Civil Engineering, Electrical Engineering or related"}
{"text": "field from a recognized institution;"}
{"text": "• At least ten (10) years relevant work experience, three (3) of which should be in a"}
{"text": "supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "15"}
{"text": "ASSISTANT MANAGER, MEMBER RECORDS (MG4)"}
{"text": "The Assistant Manager, Member Records will be reporting to the Manager, Member"}
{"text": "Records. He/she will be responsible for enhancing records management through efficient"}
{"text": "and effective creation, storage, retrieval, maintenance and disposition."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Ensure preparation and updating of file indices is effectively done;"}
{"text": "• Participate in conducting records surveys and appraisals for preparing and"}
{"text": "implementing records retention and disposal schedules;"}
{"text": "• Ensure retrieval and amalgamation of files;"}
{"text": "• Ensure preparation and updates of records management system;"}
{"text": "• Ensure the capturing of requests, complaints and complements in the records"}
{"text": "management system (TQM, register) is done effectively;"}
{"text": "• Process and index files/records to dispatch to the customers;"}
{"text": "• Ensure Sorting, arranging serially and return of files into the shelves; and"}
{"text": "• Capture of data for files outside the system."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s degree in any of the following disciplines: Information Sciences; Records"}
{"text": "Management and Information Technology, Archives and Records Management or"}
{"text": "related field from a recognized institution;"}
{"text": "• Master’s degree in any of the following disciplines: Information Sciences; Records"}
{"text": "Management and Information Technology, Archives and Records Management or"}
{"text": "related field from a recognized institution is an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Information Sciences;"}
{"text": "Records Management and Information Technology, Archives and Records"}
{"text": "Management or related field from a recognized Institution;"}
{"text": "• At least ten (10) years’ relevant cumulative work experience, three (3) of which should"}
{"text": "be in a supervisory position;"}
{"text": "• Membership to a relevant accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution;"}
{"text": "• Proficiency in computer applications."}
{"text": "ASSISTANT MANAGER, STRATEGY, PLANNING & CORPRORATE PERFORMANCE"}
{"text": "(MG4)"}
{"text": "Reporting to the Manager, Strategy, Planning & Corporate Performance, he/she will be"}
{"text": "responsible for reviewing the Corporate Strategic Plan (CSP) and organizational annual"}
{"text": "operating plan and ensure the integrated Management Systems (IMS) are up to date."}
{"text": "16"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Participate in developing and reviewing the Corporate Strategic Plan (CSP) and"}
{"text": "organizational annual operating plan;"}
{"text": "• Ensure preparation of B o a r d of Trustees’ and Managing Trustee’s (MT’s)"}
{"text": "Performance Contracts (PC);"}
{"text": "• Cascade MT’s performance contract, and developing BSCs for heads of Divisions,"}
{"text": "Departments, Regions and Branches;"}
{"text": "• Monitor and evaluate PC performance indicators;"}
{"text": "• Collaborate with the other departmental teams to find ways of working together most"}
{"text": "effectively to ensure the Fund is able to solve the challenges of our partners;"}
{"text": "• Cultivate and coordinate partnerships with Government agencies, the private sector,"}
{"text": "international agencies, civic organizations, and foreign missions; postimplementation review before project close up;"}
{"text": "• Ensure maintenance of repository and monitoring all the Fund’s partnerships and"}
{"text": "external linkages."}
{"text": "• Identify relationships with prospective and current partners, including but not limited"}
{"text": "to leading companies, foundations, and governments from East Africa, Africa and"}
{"text": "worldwide, that are likely to form win-win partnerships with the Fund;"}
{"text": "• Establish close partnerships by working in collaboration with various stakeholders"}
{"text": "across different sectors;"}
{"text": "• Organize and provide leadership to multi-stakeholder alliances, consortia,"}
{"text": "committees, task forces, or technical working groups in advancing the Fund’s"}
{"text": "interests."}
{"text": "• Ensure internal audits and external audits are undertaken for control sustenance of"}
{"text": "the IMS; and"}
{"text": "• Ensure capacity building of the Funds auditors periodically."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines; Strategic Management,"}
{"text": "Business Administration, Management or related field from a recognized institution;"}
{"text": "• Master’s Degree in any of the following disciplines; Strategic Management, Business"}
{"text": "Administration, Management or related field from a recognized institution is an"}
{"text": "added advantage;"}
{"text": "• Professional qualifications in any related discipline;"}
{"text": "• At least ten (10) years relevant cumulative work experience, three (3) of which"}
{"text": "should be in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution;"}
{"text": "• Proficiency in computer applications."}
{"text": "REGIONAL MANAGER (MG4)"}
{"text": "Reporting to the Manager, Registration & Compliance he/she will be the overall overseer"}
{"text": "and coordinator of the Branch network within a particular Region. The job holder will"}
{"text": "oversee the work of Branch Managers in the region to ensure compliance."}
{"text": "17"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Oversee branch compliance activities; monitors and evaluates branch performance;"}
{"text": "• Ensure follow-up on customer enquiries and complaints;"}
{"text": "• Oversee preparation of periodic departmental and field operation reports as well as"}
{"text": "inter departmental and external correspondences"}
{"text": "• Schedule and attend compliance visits to branch within the Region’s jurisdiction;"}
{"text": "• Plan, organize and implement Regional meetings for performance review, marketing,"}
{"text": "employers, relationship management, and staff meeting;"}
{"text": "• Set and cascade performance targets to the Branches to enable the Fund meet her"}
{"text": "corporate strategic objectives;"}
{"text": "• Coordinate budget planning, preparation and implementation for the regional office"}
{"text": "and across the respective Region;"}
{"text": "• Develop and implement strategies, initiatives and innovations for business growth"}
{"text": "across the Region"}
{"text": "• Organize and conduct stakeholder’s meetings/ open days for compliance and"}
{"text": "member education;"}
{"text": "• Ensure safe custody of Fund assets throughout the Region; Ensures safe and clean"}
{"text": "working environment within the Region;"}
{"text": "• Coordinate the CSR activities within the Region;"}
{"text": "• Oversee compliance activities such as prosecution and member education drives"}
{"text": "within the Region."}
{"text": "• Carry out quality assurance audits in the field offices;"}
{"text": "• Undertake/participate in the implementation of regional projects/committees and"}
{"text": "update the Registration and Collections Manager;"}
{"text": "• Carry out performance analysis and document reviews for target setting; and"}
{"text": "• Review Key Performance Indicators, targets in conjunction with Branch and Regional"}
{"text": "offices."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Social Sciences, Business"}
{"text": "Administration, Law, Public Relations, Marketing or related field from a recognized"}
{"text": "institution;"}
{"text": "• Master’s Degree in any of the following disciplines: Social Sciences, Business"}
{"text": "Administration, Law, Public Relations, Marketing or related field from a recognized"}
{"text": "institution is an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Social Sciences,"}
{"text": "Business Administration, Law, Public Relations, Marketing or related field from a"}
{"text": "recognized institution;"}
{"text": "• At least ten (10) years’ relevant cumulative work experience, three (3) of which"}
{"text": "should be in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Management course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "18"}
{"text": "SENIOR PRINCIPAL OFFICER, ADMINISTRATION (MG5)"}
{"text": "Reporting to the Assistant Manager, Administration, he/she will be responsible for"}
{"text": "management of transport services and overseeing mail office and switch board"}
{"text": "operations."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Manage the transport services’ expenditure within the agreed budget, and in line"}
{"text": "with the Transport policy;"}
{"text": "• Adjust transport schedules and resources to meet the changing demands;"}
{"text": "• Ensure appropriate utilization of vehicles and fuel;"}
{"text": "• Manage the renewal of applicable licenses for Fund’s fleet of motor vehicles;"}
{"text": "• Ensure repairs and maintenance are done and the services paid for have been"}
{"text": "delivered;"}
{"text": "• Coordinate the process of obtaining data on Fund Assets from various departments;"}
{"text": "• Prepare specifications of insurance requirements in preparation for tenders;"}
{"text": "• Oversee Mail office and switchboard operations;"}
{"text": "• Coordinate staff requirements, purchases & maintenance of furniture and"}
{"text": "equipment;"}
{"text": "• Initiate disposal of idle assets;"}
{"text": "• Approve requisition for cleaning materials and stationery;"}
{"text": "• Ensure reception and tea services are provided; and"}
{"text": "• Ensure that cleaning services within the Fund offices are provided and ensuring a"}
{"text": "clean work environment."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Social Sciences or related field from a recognized institution;"}
{"text": "• Master’s Degree in Social Sciences or related field from a recognized institution is"}
{"text": "an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Social Sciences;"}
{"text": "Business Administration; Public Relations or related field from a recognized"}
{"text": "institution;"}
{"text": "• At least seven (7) years’ work experience three (3) of which should be at a"}
{"text": "supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications;"}
{"text": "SENIOR PRINCIPAL OFFICER, BENEFITS (MG5)"}
{"text": "Reporting to the Assistant Manager, Benefits he/she will be responsible for ensuring"}
{"text": "proper receipting of claims from Documentation section, sorting and batching for"}
{"text": "awarding into the system."}
{"text": "19"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Ensuring verification of benefits claims to ensure completeness and accuracy of"}
{"text": "documentation;"}
{"text": "• Coordinating award of claims in system to determine amounts payable and bank"}
{"text": "details of payee(s);"}
{"text": "• Ensuring Generation of payment information reports and filing in claim files"}
{"text": "appropriately;"}
{"text": "• Overseeing examination of payment information details, endorsement and dispatch"}
{"text": "claims in system to Authorization section; and"}
{"text": "• Responding to customer’s enquiries and complaints by Branch Officers/call centre or"}
{"text": "walk-in clients."}
{"text": "• Ensure proper receipting of claims from Documentation section, sorting and batching"}
{"text": "for awarding into the system;"}
{"text": "• Ensure Verification of benefits claims to ensure completeness and accuracy of"}
{"text": "documentation;"}
{"text": "• Coordinate award of claims in system to determine amounts payable and bank details"}
{"text": "of payee(s); and"}
{"text": "• Ensure Generation of payment information reports and filing in claim files"}
{"text": "appropriately."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Actuarial Science; Social"}
{"text": "Sciences; Business Administration; Public Relations; Marketing or related field from a"}
{"text": "recognized Institution;"}
{"text": "• Masters’ Degree in any of the following disciplines: Social Sciences; Business"}
{"text": "Administration; Public Relations; Marketing or related field from a recognized"}
{"text": "Institution is an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Business Management;"}
{"text": "Public Relations; Marketing or related field from a recognized institution;"}
{"text": "• At least seven (7) years’ relevant cumulative work experience, three (3) of which"}
{"text": "should be in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Supervisory Course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, CORPORATE COMMUNICATIONS (MG5)"}
{"text": "Reporting to the Assistant Manager, Corporate Communications he/she will be"}
{"text": "responsible for Planning publicity strategies and campaigns and preparing media press"}
{"text": "releases."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Plan media stakeholder briefings;"}
{"text": "• Organize media briefings on current affairs at the Fund;"}
{"text": "• Organize broadcast interviews, press conferences;"}
{"text": "20"}
{"text": "• Analyze media coverage in regards to the Fund’s targeted audience;"}
{"text": "• Develop customized promotional messages for publicity and advertisement;"}
{"text": "• Analyze and monitor customer complaints lodged externally and internally using"}
{"text": "established complaints handling feedback mechanism; and"}
{"text": "• Develop customer value proposition strategies for handling of customer complaints"}
{"text": "effectively."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Communications, Public"}
{"text": "Relations, Journalism or related field from a recognized institution;"}
{"text": "• Master’s Degree in any of the following disciplines: Communications, Public Relations,"}
{"text": "Journalism or related field from a recognized institution is an added advantage;"}
{"text": "• Professional Qualification in any of the following disciplines: Communications, Public"}
{"text": "Relations, Journalism or related field from a recognized institution;"}
{"text": "• At least seven (7) years’ work experience, three (3) of which should be in a supervisory"}
{"text": "position"}
{"text": "• Membership to a professional accredited body related to Communications, Public"}
{"text": "Relations or Journalism such as the Public Relations Society of Kenya (PRSK),"}
{"text": "International Association of Business Communicators (IABC) or other related field and"}
{"text": "in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, ETHICS & INTEGRITY (MG5)"}
{"text": "Reporting to the Assistant Manager, Ethics & Integrity he/she will be responsible for"}
{"text": "developing and disseminating corporate ethics statements, policies and supporting forms."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Integrate the corporate ethics message throughout the ethics culture;"}
{"text": "• Conduct annual corporate governance audits to determine the state of the"}
{"text": "corporation and presenting findings to superiors;"}
{"text": "• Monitor compliance with ethics and integrity requirements in the Fund;"}
{"text": "• Conduct corruption risk assessments and preparing corruption mitigation plans;"}
{"text": "• Coordinate and training staff on the two-year wealth declarations exercise;"}
{"text": "• Participate in the development and review of ethics and integrity policies, strategies,"}
{"text": "processes and work procedures and plans;"}
{"text": "• Coordinate corruption prevention committees (CPCs);"}
{"text": "• Participate in corruption perception surveys."}
{"text": "21"}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "Bachelor’s Degree in Law, Finance, Business Management or a related field from"}
{"text": "a recognized institution;"}
{"text": "(ii) Master’s Degree in Law, Finance, Business Management or a related field from"}
{"text": "a recognized institution is an added advantage;"}
{"text": "(iii) At least seven (7) years’ work experience, three (3) of which should be at a"}
{"text": "supervisory position;"}
{"text": "(v) Professional qualification in any of the following disciplines: Law, Finance,"}
{"text": "Business Management or a related field from a recognized institution;"}
{"text": "(vi) Membership to a relevant and accredited professional body;"}
{"text": "(vii) Supervisory course from a recognized institution;"}
{"text": "(viii) Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL ACCOUNTANT, EXPENDITURE (MG5)"}
{"text": "Reporting to the Assistant Manager, Finance, he/she will be responsible for validating"}
{"text": "and confirming collections received from branches."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Issue debit receipts and maintain bounced cheque register;"}
{"text": "• Update income cashbook;"}
{"text": "• Support field office on revenue receipt activities;"}
{"text": "• Reconcile SAP and M-Pesa transactions;"}
{"text": "• Upload and post general ledger data;"}
{"text": "• Reconcile bank reports;"}
{"text": "• Pay benefit claims."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s degree in Finance, Accounting, Economics, Commerce or related field"}
{"text": "from a recognized institution;"}
{"text": "• Masters’ degree in Finance, Accounting, Economics, Commerce or related field from"}
{"text": "a recognized institution is an added advantage;"}
{"text": "• Professional qualification such as CPA (K), ACCA and/or CFA;"}
{"text": "• At least seven (7) years’ work experience three (3) of which should be in a supervisory"}
{"text": "position;"}
{"text": "• Membership to a relevant and accredited professional body such as ICPAK, ACCA"}
{"text": "and/or the CFA Institute and in good standing;"}
{"text": "• Supervisory Course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, FINGERPRINTS (MG5)"}
{"text": "Reporting to the Assistant Manager, fingerprints he/she will be responsible for"}
{"text": "ensuring prompt and positive Identification of members/beneficiaries to initiate Benefit"}
{"text": "processing and payment."}
{"text": "22"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Ensure that posthumous identification of un-identified persons without record in the"}
{"text": "National Registrations Bureau is done as requested by the Police;"}
{"text": "• Ensure proper documentation for the processing of benefits has been done;"}
{"text": "Identifying and referring multiple claims to Benefits Records Unit for amalgamation;"}
{"text": "• Establish and refer cases of multiple registrations to the Transit & Allocation Unit for"}
{"text": "fund transfer to the effective member number or suppression of ineffective numbers;"}
{"text": "• Establish and refer survivor benefit claims and invalid benefit claims to the Benefits"}
{"text": "Officer and the Benefits Authorization officer respectively;"}
{"text": "• Establish and refer age/withdrawal/emigration benefit claims to the registration of"}
{"text": "employers’/employees’ section for further processing;"}
{"text": "• Ensure that incomplete application claims are returned to the field offices for"}
{"text": "completeness;"}
{"text": "• Ensure that customer enquiries and complaints are attended to;"}
{"text": "• Authenticate certificates of member registration records with missing details; and"}
{"text": "• Amend fund member particulars for conformity to registration details in the database."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Forensic Science or related field from a recognized institution;"}
{"text": "• Masters Degree in Forensic Science or related field from a recognized institution is an"}
{"text": "added advantage;"}
{"text": "• Fingerprints analysis and examination training papers A, B and C;"}
{"text": "• At least seven (7) years’ work experience, three (3) of which should be in a supervisory"}
{"text": "position;"}
{"text": "• Member to relevant and accredited professional body and in good standing; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, HUMAN RESOURCE (MG5)"}
{"text": "Reporting to the Assistant Manager, Human Resource he/she will be responsible for"}
{"text": "formulating and ensuring implementation of leading practice strategies on human"}
{"text": "resource planning, talent sourcing, reward and organizational development and"}
{"text": "developing an annual training plan that is aligned to NSSF strategic ambitions."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Ensure maintenance of staff establishment and preparation of a resourcing plan;"}
{"text": "• Participate in the development, implementation and evaluation of HR function’s"}
{"text": "strategic plan taking into consideration the Fund’s strategy;"}
{"text": "• Develop creative and innovative talent acquisition strategies;"}
{"text": "• Participate in the review and updating of organizational structures to maximize"}
{"text": "organizational effectiveness;"}
{"text": "• Oversee the development of talent acquisition plans that ensure availability of"}
{"text": "requisite numbers and skill categories to enable the Fund achieve its objectives;"}
{"text": "• Ensure the induction and probation process is effective for successful onboarding"}
{"text": "experiences as well as timely confirmations of all new hires;"}
{"text": "23"}
{"text": "• Ensure implementation of an effective reward management and remuneration policies"}
{"text": "and strategies that promote talent acquisition, retention, motivation and improved"}
{"text": "productivity"}
{"text": "• Manage the Human Resource Information System and ensuring accurate"}
{"text": "documentation process manuals are designed and updated for all HRIS processes;"}
{"text": "• Collect, analyze and maintain data to inform talent development interventions;"}
{"text": "• Prepare the training and development needs assessment;"}
{"text": "• Develop relationships with relevant external trainers and training/learning institutions"}
{"text": "to facilitate and coordinate further learning programs for staff;"}
{"text": "• Develop and manage the Performance Management Cycle/Calendar;"}
{"text": "• Create awareness in the Fund on the requirements of the Performance Management"}
{"text": "System through trainings and other measures;"}
{"text": "• Manage development and implementation of monitoring systems for performance"}
{"text": "indicators and standards, including ensuring data quality and compliance with internal"}
{"text": "and external audit requirements;"}
{"text": "• Ensure effective performance reviews are undertaken; and"}
{"text": "• Ensure that succession planning is integrated with business planning."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines; Human Resource Management,"}
{"text": "Business Administration, Social Sciences or a related field from a recognized"}
{"text": "Institution;"}
{"text": "• Master’s Degree in any of the following disciplines; Human Resource Management,"}
{"text": "Business Administration, Social Sciences or a related field from a recognized"}
{"text": "institution is an added advantage;"}
{"text": "• Professional qualification in Human Resource Management, such as CHRP (K) or its"}
{"text": "equivalent from a recognized institution;"}
{"text": "• At least seven (7) years’ work experience, three (3) of which should be in a supervisory"}
{"text": "position;"}
{"text": "• Membership in a relevant and accredited professional body and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, ICT (MG5)"}
{"text": "Reporting to the Assistant Manager, ICT he/she will be responsible for Implementing IT"}
{"text": "project solutions."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Develop overall change management on technological adoption;"}
{"text": "• Research emerging Information Technology to be adopted;"}
{"text": "• Formulate innovative solutions to the business;"}
{"text": "• Verify proposed solutions and communicating to the users;"}
{"text": "• Coordinate between functional users’ requests and the solution providers;"}
{"text": "• Develop policies and procedures, within company guidelines, for the IT unit and"}
{"text": "providing guidance in the interpretation and implementation of these;"}
{"text": "24"}
{"text": "• Continuously review and improve customer service and quality assurance policies,"}
{"text": "procedures and processes;"}
{"text": "• Ensure the integration of processes to maintain and develop the required services to"}
{"text": "support and improve effectiveness of the core activities;"}
{"text": "• Translate business practices and processes into architectures to enable delivery of"}
{"text": "appropriate solutions;"}
{"text": "• Review network configuration and planning cost-effective upgrades to keep up with"}
{"text": "changing technology, growth and needs of Fund’s components;"}
{"text": "• Conduct research and make recommendations on network products, services,"}
{"text": "protocols, and standards in support of network procurement and development efforts;"}
{"text": "• Monitor system performance of the core Network, routers and WAN links to ensure"}
{"text": "optimum efficiency;"}
{"text": "• Formulate and implement Information Security Section policies and procedures and"}
{"text": "ensure compliance with IT security policy;"}
{"text": "• Oversee the installation, testing and implementation of applications and databases;"}
{"text": "• Coordinate the day-to-day administration of systems and user IDs including creation,"}
{"text": "deletion, modification, resets or extensions and roles assignment; and"}
{"text": "• Conduct information risk assessments to identify gaps and give solutions to mitigate"}
{"text": "security incidents and breaches;"}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Computer Science, Information Technology or related field from"}
{"text": "a recognized institution;"}
{"text": "• Masters’ Degree in Computer Science, Information Technology or related field from a"}
{"text": "recognized institution is an added advantage;"}
{"text": "• Professional qualification such as CISA, MCSE, CCNA, CCNP, CCIE, CNE or any"}
{"text": "other relevant qualification from a recognized institution;"}
{"text": "• At least seven (7) years’ work experience three (3) of which should be in a supervisory"}
{"text": "role;"}
{"text": "• Membership in good standing to a relevant and accredited professional body and in"}
{"text": "good standing;"}
{"text": "• Supervisory course or its equivalent;"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, INTERNAL AUDIT (MG5)"}
{"text": "Reporting to the Assistant Manager, Internal Audit, he/she will be responsible for"}
{"text": "Coordinating and supervising the execution of all audit assignments under the department"}
{"text": "and reports."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Participate in designing the Internal Audit process for the Fund;"}
{"text": "• Coordinate the preparation of the annual risk plan by analyzing key activities and"}
{"text": "processes in various department and prepare a summary of the auditable areas/audit"}
{"text": "centres for all the departments;"}
{"text": "25"}
{"text": "• Review the adequacy of the audit client responses to the audit findings;"}
{"text": "• Conduct exit meetings and lead discussions on the findings, risk exposures and"}
{"text": "recommendations;"}
{"text": "• Review final audit report, incorporating any revisions resulting from the exit meeting"}
{"text": "discussions; and"}
{"text": "• Conduct ad-hoc/special investigations and review arising from routine audits and/or"}
{"text": "as requested by management."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor's Degree in Finance, Economics, Statistics, Project Management, Business"}
{"text": "Administration or any other relevant qualification from a recognized institution;"}
{"text": "• Master’s Degree in Finance, Economics, Statistics, Project Management, Business"}
{"text": "Administration or any other relevant qualification from a recognized institution is an"}
{"text": "added advantage;"}
{"text": "• Professional qualification such as CIA, CISA, ACCA, CPA (K), CRMA, PRM or"}
{"text": "equivalent from a recognized institution;"}
{"text": "• At least seven (7) years’ work experience, three (3) of which should have been in a"}
{"text": "supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body such as ICPAK, ACCA or"}
{"text": "any other relevant qualification and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, INVESTMENTS/TPS/ACTUARIAL (MG5)"}
{"text": "Reporting to the Assistant Manager, Investments/Actuarial/Insurance he/she will be"}
{"text": "responsible for coordinating with consultants to prepare and/or review policy documents"}
{"text": "such as Investment Strategy, Investment Policy and Interest Declaration and Reserve"}
{"text": "Allocation Policy"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Conduct actuarial valuations;"}
{"text": "• Analysis of insurable assets and the insurance contracts;"}
{"text": "• Ensure budgets for investment purposes;"}
{"text": "• Liaise with consultants to coordinate data collection for actuarial valuation;"}
{"text": "• Ensure monitoring of the performance of the portfolio, asset allocation and the"}
{"text": "compliance of the same to laws and regulations;"}
{"text": "• Analyze technical specifications for the procurement of investment service providers."}
{"text": "This entails the review of contracts;"}
{"text": "• Coordinate portfolio construction, for example, asset allocation, identification and"}
{"text": "analysis of new opportunities;"}
{"text": "• Ensure Preparation of Board Papers and other ad hoc reports;"}
{"text": "• Monitor cash flows and coordinating the transfer of surplus funds for investment;"}
{"text": "• Monitor investment service providers;"}
{"text": "• Analyze invoiced fees and preparing memos seeking approvals where necessary."}
{"text": "26"}
{"text": "• Manage the Fund’s portfolio of securities to ensure profitability and compliance with"}
{"text": "the Fund’s risk management policy;"}
{"text": "• Work closely with external Fund Managers and Custodians in the implementation of"}
{"text": "the Fund’s investment portfolio;"}
{"text": "• Identify sources of surplus funds for investment and/or to meet shortages, placing and"}
{"text": "monitoring investment offers;"}
{"text": "• Undertake relevant market research to advise management on appropriate"}
{"text": "investment opportunities available;"}
{"text": "• Increases risk adjusted returns on member funds"}
{"text": "• Manages, leads and develops staff"}
{"text": "• Prepares investment policy"}
{"text": "• Manage TPS customers’ accounts efficiently and effectively."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Insurance, Actuarial Science, Accounting, Finance, Economics"}
{"text": "or related field from a recognized institution;"}
{"text": "• Masters’ Degree in Insurance, Actuarial Science, Accounting, Finance, Economics or"}
{"text": "related field from a recognized institution is and added advantage;"}
{"text": "• Professional Qualification such as Certified Financial Analyst (CFA), Certified"}
{"text": "Investment and Financial Analyst (CIFA), Certification in Insurance or any other"}
{"text": "relevant qualification;"}
{"text": "• At least seven (7) years’ relevant cumulative work experience, three (3) of which"}
{"text": "should have been in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, LEGAL SERVICES (MG5)"}
{"text": "Reporting to the Assistant Manager, Legal & Regulatory Services he/she will be"}
{"text": "responsible for ensuring the management of pre-litigation processes including collection"}
{"text": "of evidence, pre-trial procedures, preparation of witnesses, preparation of legal briefs,"}
{"text": "development of strategies and testimonies."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Represent the Fund before any court or tribunal as a witness or to watch brief as"}
{"text": "necessary or to defend or to sue on behalf of the Fund;"}
{"text": "• Manage relationships with external counsel to ensure co-ordination and"}
{"text": "collaboration;"}
{"text": "• Review and assess the services of external counsel and making"}
{"text": "recommendations/reports to the Manager, Legal and Regulatory Services as"}
{"text": "appropriate."}
{"text": "• Review budget that relates to advisory services;"}
{"text": "• Review legal briefs and rendering legal opinion on contract;"}
{"text": "27"}
{"text": "• Prepare/amend any policy and strategic issues as and when required;"}
{"text": "• Review contracts both local and international including loan, mortgage, pledge,"}
{"text": "guarantees and providing warranted recommendations to protect the Fund’s interest;"}
{"text": "• Develop contract negotiation strategies and builds capacity for contract negotiation;"}
{"text": "• Oversee, review and draft contracts and development of standard templates for the"}
{"text": "Fund’s use;"}
{"text": "• Develop and maintain a comprehensive contract management database ensuring all"}
{"text": "Fund contracts are well archived and appropriately serialized; and"}
{"text": "• Maintain a contractual risk register and develop mechanisms to identify early warning"}
{"text": "of risk to enable early interventions and mitigation;"}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor of Laws Degree from a recognized institution;"}
{"text": "• Master of Laws Degree from a recognized institution is an added advantage;"}
{"text": "• Postgraduate Diploma in Legal Studies from the Council for Legal Education;"}
{"text": "• Admitted as an advocate of the High Court of Kenya;"}
{"text": "• At least seven (7) years’ relevant cumulative work experience, three (3) of which"}
{"text": "should have been in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body such as the Law Society"}
{"text": "of Kenya (LSK) and/or Institute of Certified Secretaries (ICS);"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, MARKETING, MEMBER AND CUSTOMER"}
{"text": "EXPERIENCE (MG5)"}
{"text": "Reporting to the Assistant Manager, Marketing, Member & Customer experience, he/she"}
{"text": "will be responsible for Participating in aggressive and innovative marketing campaigns,"}
{"text": "including activations, media management & experiential campaigns."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Participate in brand building activities through extensive member education using"}
{"text": "media, road shows and sponsorships;"}
{"text": "• Support Customer Service initiatives to ensure customer satisfaction;"}
{"text": "• Keep inventory and oversees the distribution of marketing and sensitization"}
{"text": "materials to the branches/regions;"}
{"text": "• Support branches and regions with their marketing activities;"}
{"text": "• Participate in event management;"}
{"text": "• Receive correspondences for the institution, sign for receipt and facilitate dispatch"}
{"text": "to the respective office or persons;"}
{"text": "• Collect customer feedback and prepare weekly reports to help in improving"}
{"text": "products/services;"}
{"text": "• Cross sell the Institute's products to potential and existing customers to aid the"}
{"text": "department in meeting its targets;"}
{"text": "28"}
{"text": "• Conduct live chats with potential customers who visit NSSF Website to ensure they"}
{"text": "are well informed, and they receive all the needed customer support;"}
{"text": "• Manage SMS code through generating daily SMS reports and respond accordingly,"}
{"text": "to enhance efficient communication with customers;"}
{"text": "• Follow up on online queries to convert online leads to customers; and"}
{"text": "• Participate in marketing campaigns to create awareness of the Fund’s products;"}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Marketing, Business Administration or related field from a"}
{"text": "recognized institution;"}
{"text": "• Masters’ Degree in Marketing, Business Administration or related field from a"}
{"text": "recognized institution is an added advantage;"}
{"text": "• Professional Qualification in Marketing, Business Administration or related field;"}
{"text": "• At least seven (7) years’ relevant cumulative work experience, three (3) of which"}
{"text": "should be in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body such as the Marketing"}
{"text": "Society of Kenya (MSK) and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, PROPERTY DEVELOPMENT (MG5)"}
{"text": "Reporting to the Assistant Manager, Property Development he/she will be responsible for"}
{"text": "Conducting project inspections and reporting on production while managing related"}
{"text": "contracts."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Review designs and drawings;"}
{"text": "• Conduct project inspections and report on production while managing related"}
{"text": "contracts;"}
{"text": "• Confirm fee notes and certificates for payment;"}
{"text": "• Prepare plans, layouts, designs, reports and cost estimates for budgeting and property"}
{"text": "development purposes and for proposed routine maintenance works and new"}
{"text": "projects, either in house or in liaison with consultants and contractors;"}
{"text": "• Evaluate performance standards for consultants and contractors for on-going projects"}
{"text": "and advise management on appropriate action;"}
{"text": "• Evaluate and Analyze tender and project scheduling and monitoring;"}
{"text": "• Attend site meetings to evaluate project progress;"}
{"text": "• Pursue statutory approvals in conjunction with project consultants; and"}
{"text": "• Perform project hand-over inspections and sign-off."}
{"text": "29"}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Architecture, Quantity Survey,"}
{"text": "Construction, Civil Engineering, Electrical Engineering or related field from a"}
{"text": "recognized institution;"}
{"text": "• Master’s Degree in any of the following disciplines: Architecture, Quantity Survey,"}
{"text": "Construction, Civil Engineering, Electrical Engineering or related field from a"}
{"text": "recognized institution is an added advantage;"}
{"text": "• Professional Qualification in any of the following disciplines: Architecture, Quantity"}
{"text": "Survey, Construction, Civil Engineering, Electrical Engineering or related field from a"}
{"text": "recognized institution;"}
{"text": "• At least seven (7) years relevant cumulative work experience, three (3) of which"}
{"text": "should have been in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, PROPERTY MANAGEMENT (MG5)"}
{"text": "Reporting to the Assistant Manager, Property Management he/she will be responsible for"}
{"text": "managing the Fund’s properties prudently and optimize returns."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Verify bid documents and targets for the property management agents’ rental levels,"}
{"text": "maintenance and general procedures;"}
{"text": "• Ensure preparation of applications for prospective tenants fronted by the Property"}
{"text": "agents;"}
{"text": "• Liaise with agents to ensure that they advertise and rent out the Fund’s properties;"}
{"text": "• Coordinate monthly inspections of the buildings with the property management"}
{"text": "agents;"}
{"text": "• Ensure forwarding of valuation requests and relevant documentation to the Chief"}
{"text": "Government Valuer and independent valuers;"}
{"text": "• Analyze Management reports for all Fund properties and maintain all relevant logs"}
{"text": "records and information relating to the properties required;"}
{"text": "• Resolve of conflicts between tenants and the managing agents;"}
{"text": "• Ensure the Fund properties adhere to all statutory regulations; and"}
{"text": "• Administer leases for the Fund Commercial buildings and lease offices."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Land Economics, Real Estate, Construction, Planning, or related"}
{"text": "field from a recognized institution;"}
{"text": "• Master’s Degree in Land Economics, Real Estate, Construction, Planning or related"}
{"text": "field from a recognized institution is an added advantage;"}
{"text": "30"}
{"text": "• Professional Qualification in any of the following disciplines: Real Estate, Land"}
{"text": "Economics, Planning, Property Management or related field from a recognized"}
{"text": "institution;"}
{"text": "• At least seven (7) years’ relevant cumulative work experience, three (3) of which"}
{"text": "should have been in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, REGISTRATION & COMPLIANCE (MG5)"}
{"text": "Reporting to the Assistant Manager, Registration & Compliance he/she will be"}
{"text": "responsible for Coordinating registration activities within the Branch/ Region;"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Validating employer returns and generating Unique Payment Numbers for receipting;"}
{"text": "• Facilitating clearance of Suspense account by establishing correct NSSF numbers;"}
{"text": "• Coordinating member education activities to enlighten members on NSSF scheme;"}
{"text": "• Maintaining and ensuring safe custody of registration records including registers,"}
{"text": "Duplicate Membership Cards and B-Certificates; and"}
{"text": "• Making follows up on delayed search cases for issuance of duplicate membership"}
{"text": "card."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Social Sciences; Business"}
{"text": "Administration; Marketing or related field from a recognized Institution;"}
{"text": "• Master’s Degree in any of the following disciplines: Social Sciences; Business"}
{"text": "Administration; Marketing or related field from a recognized Institution is an added"}
{"text": "advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Business Management;"}
{"text": "Public Relations; Marketing or related field from a recognized institution;"}
{"text": "• At least seven (7) years’ work experience, three (3) years of which should be in a"}
{"text": "supervisory position;"}
{"text": "• Membership to a relevant accredited professional body and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, RESEARCH AND INNOVATION (MG5)"}
{"text": "Reporting to the Assistant Manager, Research, Policy & Innovation, he/she will be"}
{"text": "responsible for Coordinating with external clients on requests for data and surveys from"}
{"text": "NSSF."}
{"text": "31"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Coordinate inception meetings with user departments and consultants for internal and"}
{"text": "external surveys;"}
{"text": "• Ensure preparation and submission of data and reports to KNBS;"}
{"text": "• Supervise data collection for the surveys in the field;"}
{"text": "• Prepare internal survey reports for tabling in senior Management meetings;"}
{"text": "• Participate in the development of new ideas including brand-led innovation, new"}
{"text": "business creation, new products; and"}
{"text": "• Collate and analyze employees’ ideas for further processing."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines; Finance, Economics,"}
{"text": "Mathematics, Statistics or a related field from a recognized institution;"}
{"text": "• Masters’ Degree in any of the following disciplines; Finance, Economics, Mathematics,"}
{"text": "Statistics or a related field from a recognized institution is an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines; Finance, Economics,"}
{"text": "Mathematics, Statistics or a related field from a recognized institution;"}
{"text": "• At least seven (7) years’ work experience, three (3) of which should be in a supervisory"}
{"text": "position;"}
{"text": "• Membership in good standing to a professional accredited body;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications;"}
{"text": "SENIOR PRINCIPAL ACCOUNTANT, REVENUE (MG5)"}
{"text": "Reporting to the Assistant Manager, Finance, he/she will be responsible for validating"}
{"text": "and confirming collections received from branches."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Issue debit receipts and maintain bounced cheque register;"}
{"text": "• Update income cashbook;"}
{"text": "• Support field office on revenue receipt activities;"}
{"text": "• Reconcile SAP and M-Pesa transactions;"}
{"text": "• Upload and post general ledger data;"}
{"text": "• Reconcile bank reports; and"}
{"text": "• Pay benefit claims."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Finance, Accounting, Economics, Commerce or related field"}
{"text": "from a recognized institution;"}
{"text": "• Masters’ degree in Finance, Accounting, Economics, Commerce or related field from"}
{"text": "a recognized institution is an added advantage;"}
{"text": "• At least seven (7) years’ work experience three (3) of which should be in a supervisory"}
{"text": "position;"}
{"text": "32"}
{"text": "• Professional qualification such as CPA (K), ACCA and/or CFA;"}
{"text": "• Membership to a relevant and accredited professional body such as ICPAK, ACCA"}
{"text": "and/or the CFA Institute and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, SECURITY (MG5)"}
{"text": "Reporting to the Assistant Manager, Security he/she will be responsible for Overseeing"}
{"text": "protection of the Fund’s property, office premises and assets, both developed and"}
{"text": "undeveloped."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Coordinate training of staff and other stakeholders on Safety, Health and Security"}
{"text": "awareness;"}
{"text": "• Carry out security audits of the Fund’s commercial properties;"}
{"text": "• Prepare and forward investigation reports to Senior Principal Officer, Security"}
{"text": "Services;"}
{"text": "• Oversee spot checks to assess/evaluate the performance of contracted security"}
{"text": "service providers;"}
{"text": "• Coordinate surveillance on the Fund’s undeveloped properties;"}
{"text": "• Gather intelligence on potential security threats to the Fund’s assets and personnel;"}
{"text": "• Report criminal cases and incidents to police and other law enforcement organs for"}
{"text": "further action;"}
{"text": "• Assist in the management of emergency situations; and"}
{"text": "• Organize and Manage Annual Emergency Drills."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Criminology or any security-related field from a recognized"}
{"text": "institution;"}
{"text": "• Master’s Degree in Criminology or any security-related field from a recognized"}
{"text": "institution is an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Criminology, Law or any"}
{"text": "security-related field from a recognized institution;"}
{"text": "• At least seven (10) years’ work experience, three (3) of which should be in a"}
{"text": "supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Supervisory Course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, SUPPLY CHAIN MANAGEMENT (MG5)"}
{"text": "Reporting to the Assistant Manager, Supply Chain Management, he/she will ensure"}
{"text": "procurements are made in a timely manner and in line with policies of the Fund and the"}
{"text": "Public Procurement and Asset Disposal Act 2015."}
{"text": "33"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Negotiate contracts & SLAs, write reports and upload tender documents on IFMI;"}
{"text": "• Maintain & safeguard procurement documents;"}
{"text": "• Review the strategic plan dashboard and strategic plan matrix reports of the"}
{"text": "department;"}
{"text": "• Track reports for all processes in the department and report the status of all activities"}
{"text": "in the department;"}
{"text": "• Verify purchase requisitions and raise purchase orders from field offices;"}
{"text": "• Prepare reports on awards to special/AGPO groups;"}
{"text": "• Monitor and evaluate supplier performance;"}
{"text": "• Review the strategic plan dashboard and strategic plan matrix reports of the"}
{"text": "department;"}
{"text": "• Analyze vendors on pricing, delivery reliability, delivery date adherence and quality of"}
{"text": "item for the purpose of reducing supply chain costs and improve on the quality and"}
{"text": "timeliness of the delivery of the item(s);"}
{"text": "• Provide support in developing a vendor rating system/matrix;"}
{"text": "• Regularly update the vendor rating system;"}
{"text": "• Monitor the vendor database;"}
{"text": "• Prepare correspondences with vendors;"}
{"text": "• Prepare communication with relevant internal departments on vendor related issues;"}
{"text": "• Check maintenance of updated records for receipts and issues; and"}
{"text": "• Ensure annual stock-taking is done and that quarterly stock reconciliation is correctly"}
{"text": "done."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s degree in Procurement, Commerce, Economics Finance or related field"}
{"text": "from a recognized institution;"}
{"text": "• Master’s degree in Procurement, Commerce, Economics Finance or related field from"}
{"text": "a recognized institution is an added advantage;"}
{"text": "• Professional Qualification in Procurement or related field;"}
{"text": "• At least seven (7) years of relevant cumulative work experience, three (3) years of"}
{"text": "which should be in a supervisory role;"}
{"text": "• Membership to Institute of Supplies Management (KISM) or Chartered Institute of"}
{"text": "Supplies in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SENIOR PRINCIPAL OFFICER, ADMINISTRATION (MG5)"}
{"text": "Reporting to the Assistant Manager, Administration, he/she will be responsible for"}
{"text": "management of transport services and overseeing mail office and switch board"}
{"text": "operations."}
{"text": "34"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Manage the transport services’ expenditure within the agreed budget, and in line"}
{"text": "with the Transport policy;"}
{"text": "• Adjust transport schedules and resources to meet the changing demands;"}
{"text": "• Ensure appropriate utilization of vehicles and fuel;"}
{"text": "• Manage the renewal of applicable licenses for Fund’s fleet of motor vehicles;"}
{"text": "• Ensure repairs and maintenance are done and the services paid for have been"}
{"text": "delivered;"}
{"text": "• Coordinate the process of obtaining data on Fund Assets from various departments;"}
{"text": "• Prepare specifications of insurance requirements in preparation for tenders;"}
{"text": "• Oversee Mail office and switchboard operations;"}
{"text": "• Coordinate staff requirements, purchases & maintenance of furniture and"}
{"text": "equipment;"}
{"text": "• Initiate disposal of idle assets;"}
{"text": "• Approve requisition for cleaning materials and stationery;"}
{"text": "• Ensure reception and tea services are provided; and"}
{"text": "• Ensure that cleaning services within the Fund offices are provided and ensuring a"}
{"text": "clean work environment."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Social Sciences or related field from a recognized institution;"}
{"text": "• Master’s Degree in Social Sciences or related field from a recognized institution is"}
{"text": "an added advantage;"}
{"text": "• Professional qualification in any of the following disciplines: Social Sciences;"}
{"text": "Business Administration; Public Relations or related field from a recognized"}
{"text": "institution;"}
{"text": "• At least seven (7) years’ work experience three (3) of which should be at a"}
{"text": "supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "• Supervisory course from a recognized institution; and"}
{"text": "• Proficiency in computer applications;"}
{"text": "BRANCH MANAGER (MG5)"}
{"text": "Reporting to the Regional Manager, he/she will be responsible for coordinating the overall"}
{"text": "Branch operations and ensures achievement of organizational strategic objectives at the"}
{"text": "branch."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Oversee enforcement of the NSSF Act No.45 of 2013 Laws of Kenya;"}
{"text": "• Plan, develop and implement work schedules and targets by staff at the Branch;"}
{"text": "• Develop and implement registration and collection plans according to zonal"}
{"text": "management principles that ensure the development of zonal plans;"}
{"text": "35"}
{"text": "• Coordinate all Benefits and Compliance activities including registration of"}
{"text": "employers/employees, collection of contributions, investigations, prosecutions and"}
{"text": "default recovery at the Branch;"}
{"text": "• Educate members and market Fund’s products;"}
{"text": "• Build and maintain a cohesive Branch team;"}
{"text": "• Ensure customer satisfaction by providing proactive customer care services and"}
{"text": "maintain effective follow up;"}
{"text": "• Maintain proper and up to date records at the Branch;"}
{"text": "• Prepare and submit monthly, quarterly, half year and annual financial, performance"}
{"text": "contracting and progress reports to management;"}
{"text": "• Maintain a clean and safe working environment;"}
{"text": "• Receive and ensure safe custody of accountable and sensitive documents and"}
{"text": "materials including cheques, LPOs, LSOs, employee confidential files; and"}
{"text": "• Sign and issue notification letters and certificates to registered employers."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Social Sciences; Business"}
{"text": "Administration; Law; Public Relations; Marketing or a related field from a recognized"}
{"text": "institution;"}
{"text": "• Master’s Degree in any of the following disciplines: Social Sciences; Business"}
{"text": "Administration; Law; Public Relations; Marketing or a related field from a recognized"}
{"text": "institution is an added advantage;"}
{"text": "• Professional qualification in a related field from a recognized institution;"}
{"text": "• At least seven (7) years’ work experienced, three (3) of which should be in a"}
{"text": "supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing; and"}
{"text": "• Proficiency in computer applications."}
{"text": "COMPETENCIES:"}
{"text": "The competencies required for Assistant Manager, Regional Manager and Senior"}
{"text": "Principal Officer are as follows:"}
{"text": "• Ability to formulate policies & strategies"}
{"text": "• Analytical Thinking"}
{"text": "• Ability to build & work through teams"}
{"text": "• Leadership & Management Skills"}
{"text": "• Excellent interpersonal & communication Skills"}
{"text": "• Initiative, Innovation and Creativity"}
{"text": "• Adaptability"}
{"text": "36"}
{"text": "PRINCIPAL PROPERTY MANAGEMENT OFFICER (MG6)"}
{"text": "Reporting to the Assistant Manager, Property Management he/she will be responsible for"}
{"text": "preparing bid documents."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Monitor/make follow-ups on targets for the property management agents;"}
{"text": "rental levels, maintenance and general procedures;"}
{"text": "• Process applications for prospective tenants fronted by the Property agents;"}
{"text": "• Make follow-ups on agents to ensure that they and rent out the Fund’s properties;"}
{"text": "• Conduct monthly inspections of the buildings with the property management agents;"}
{"text": "• Forward valuation requests and relevant documentation to the Chief Government"}
{"text": "Valuer and independent valuers;"}
{"text": "• Maintain up-to-date financial records from property operations and liaise with the"}
{"text": "finance team to reconcile statements from agents and generate monthly financial"}
{"text": "reports as required;"}
{"text": "• Prepare Management reports for all Fund properties and maintain all relevant logs"}
{"text": "records and information relating to the properties required; and"}
{"text": "• Administer leases for the Fund Commercial buildings and lease offices."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Land Economics, Real Estate, Construction, Planning, or"}
{"text": "related field from a recognized institution;"}
{"text": "• Professional Qualification in any of the following disciplines: Real Estate, Land"}
{"text": "Economics, Planning, Property Management or related field from a recognized"}
{"text": "institution;"}
{"text": "• At least five (5) years’ work experience;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing;"}
{"text": "and"}
{"text": "• Proficiency in computer applications."}
{"text": "PRINCIPAL COMPLIANCE OFFICER (MG6)"}
{"text": "Reporting to the Branch Manager or Assistant Manager, Registration & Compliance"}
{"text": "he/she will be responsible for enforcing compliance of NSSF Act No. 45 of 2013 with"}
{"text": "regard to collection of contributions and registration of employers and employees and"}
{"text": "employer/member education."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Educate/sensitize employers, employees and other members of the public on the"}
{"text": "NSSF Act No. 45 of 2013;"}
{"text": "• Undertake inspection of employer records to ensure that the provisions of the NSSF"}
{"text": "Act No. 45 of 2013 are being observed;"}
{"text": "• Facilitate registration of new employers, employees and voluntary contributors in"}
{"text": "collaboration with the Registration Officer;"}
{"text": "37"}
{"text": "• Update and maintain zonal records including employers’ lists, contribution registers,"}
{"text": "defaulters list, penalty and bounced cheques;"}
{"text": "• Monitor and follow up on employer compliance;"}
{"text": "• Investigate and prosecute non-compliant employers;"}
{"text": "• Prepare inspection and zonal reports;"}
{"text": "• Conduct investigation of difficult benefit cases;"}
{"text": "• Attend to member and employer Complaints;"}
{"text": "• Serve court sermons; and"}
{"text": "• Validate employer returns and create UPNs for cash receipting."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Social Sciences; Business"}
{"text": "Administration; Law, Public Relations; Marketing or related field from a recognized"}
{"text": "Institution;"}
{"text": "• Professional Qualification in any of the following disciplines: Social Sciences;"}
{"text": "Business Administration; Law, Public Relations; Marketing or related field from a"}
{"text": "recognized Institution;"}
{"text": "• At least five (5) years’ work experience; and"}
{"text": "• Proficiency in computer applications."}
{"text": "PRINCIPAL REGISTRATION OFFICER (MG6)"}
{"text": "Reporting to the Branch Manager or Assistant Manager, Registration & Compliance"}
{"text": "he/she will be responsible for carrying out registration of employers, employees and"}
{"text": "voluntary contributors in collaboration with the Compliance Officers."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Validate employer returns and generate Unique Payment Numbers for receipting;"}
{"text": "• Facilitate clearance of Suspense account by establishing correct NSSF numbers;"}
{"text": "• Conduct member education to enlighten members on the importance of registering"}
{"text": "with the Fund;"}
{"text": "• Maintain and ensure safe custody of registration records including registers, Duplicate"}
{"text": "Membership Cards and B’ certificates; and"}
{"text": "• Make follow up on delayed search cases for issuance of duplicate membership cards."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Social Sciences, Business"}
{"text": "Administration, Marketing;"}
{"text": "• Professional qualification in any of the following disciplines: Social Sciences, Business"}
{"text": "Administration, Marketing or related field from a recognized institution;"}
{"text": "• At least five (5) years’ work experience;"}
{"text": "• Membership to a relevant and accredited professional body; and"}
{"text": "• Proficiency in computer applications."}
{"text": "38"}
{"text": "PRINCIPAL RECORDS MANAGEMENT OFFICER (MG6)"}
{"text": "Reporting to the Assistant Manager, Records he/she will be responsible for ensuring that"}
{"text": "the preparation and updating of file indices is effectively done."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Participate in conducting records surveys and appraisals for preparing and"}
{"text": "implementing records retention and disposal schedules;"}
{"text": "• Implement procedures for classification, maintenance, protection and disposition;"}
{"text": "• Ensure retrieval, amalgamation of files and capturing of requests, complaints and"}
{"text": "complements in the records;"}
{"text": "• Ensure the management system (TQM, register) is done effectively;"}
{"text": "• Ensure Preparation and updates of records management system;"}
{"text": "• Search for records/files in the system for retrieval of records;"}
{"text": "• Process and index files/records to dispatch to the customers;"}
{"text": "• Ensure Sorting, arranging serially and return of files into the shelves;"}
{"text": "• Undertake record census to identify missing/overdue files; and"}
{"text": "• Ensure the capturing of data for files outside the system."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s degree in any of the following disciplines: Information Sciences; Records"}
{"text": "Management and Information Technology, Archives and Records Management or"}
{"text": "related field from a recognized Institution;"}
{"text": "• Professional qualification in any of the following disciplines: Information Sciences;"}
{"text": "Records Management and Information Technology, Archives and Records"}
{"text": "Management or related field from a recognized Institution;"}
{"text": "• At least five (5) years’ work experience; and"}
{"text": "• Proficiency in computer applications;"}
{"text": "PRINCIPAL PROPERTY DEVELOPMENT OFFICER (MG6)"}
{"text": "Reporting to the Assistant Manager, Property Development he/she will be responsible for"}
{"text": "reviewing designs and drawings for building projects."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Conduct project inspections and reporting on production while managing related"}
{"text": "contracts;"}
{"text": "• Confirming fee notes and certificates for payment;"}
{"text": "• Prepare plans, layouts, designs, reports and cost estimates for budgeting and property"}
{"text": "development purposes and for proposed routine maintenance works and new"}
{"text": "projects, either in house or in liaison with consultants and contractors;"}
{"text": "• Evaluate performance standards for consultants and contractors for on-going projects"}
{"text": "and advise management on appropriate action;"}
{"text": "• Evaluate and Analyze tender and project scheduling and monitoring,"}
{"text": "39"}
{"text": "• Attend site meetings to evaluate project progress;"}
{"text": "• Pursue statutory approvals in conjunction with project consultants; and"}
{"text": "• Perform project hand-over inspections and sign-off."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in any of the following disciplines: Architecture, Quantity Survey,"}
{"text": "Construction, Civil Engineering, Electrical Engineering or related field from a"}
{"text": "recognized institution;"}
{"text": "• Professional Qualification in any of the following disciplines: Architecture, Quantity"}
{"text": "Survey, Construction, Civil Engineering, Electrical Engineering or related field from a"}
{"text": "recognized institution;"}
{"text": "• At least five (5) years relevant work experience;"}
{"text": "• Membership to a relevant and accredited professional body and in good standing; and"}
{"text": "• Proficiency in computer applications."}
{"text": "PRINCIPAL OFFICER, RISK MANAGEMENT (MG6)"}
{"text": "Reporting to the Senior Principal Officer, Risk Management he/she will be responsible for"}
{"text": "assisting in the preparation of the annual risk plan."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Plan the risk assessments comprising of preliminary surveys of processes to be"}
{"text": "reviewed, evaluation of applicable Risk Management frameworks, protocols, policies"}
{"text": "and procedures, development of risk assessment templates;"}
{"text": "• Coordinate and conduct risk and control self-assessment to ensure conformity with"}
{"text": "the Enterprise Risk Management Framework and other policies;"}
{"text": "• Participate in the review of risk assessment reports;"}
{"text": "• Organize management meetings to discuss the observations, risk exposures and"}
{"text": "recommendations;"}
{"text": "• Review and prepare the final risk assessment report, incorporating any revisions"}
{"text": "resulting from the management discussions;"}
{"text": "• Conduct continuous risk assessments and generate risk sensitization memos;"}
{"text": "• Facilitate the preparation of the Fund's risk register and evaluate the risks in relation"}
{"text": "to agreed criteria and maintaining the register based on the Enterprise Risk"}
{"text": "Management, Business Continuity and Information Security Frameworks;"}
{"text": "• Follow up and track the progress of remediation of risk and control weaknesses"}
{"text": "identified by Risk Assessment, Internal Audit, self-testing, or controls assessment."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor's Degree in Finance, Economics, Statistics, Actuarial Science, Project"}
{"text": "Management, Business Administration or any other relevant qualification from a"}
{"text": "recognized institution;"}
{"text": "• Professional qualification such as CIA, CISA, ACCA, CPA (K), CRMA, PRM, FSA,"}
{"text": "CERA or equivalent from a recognized institution;"}
{"text": "40"}
{"text": "• At least five (5) years of relevant cumulative work experience, three (3) of which should"}
{"text": "be in a supervisory position;"}
{"text": "• Membership to a relevant and accredited professional body such as ICPAK, IIA,"}
{"text": "ISACA, SoA, IFoA, ACCA, TASK or any other relevant qualification and in good"}
{"text": "standing; and"}
{"text": "• Proficiency in computer applications."}
{"text": "PRINCIPAL OFFICER, INTERNAL AUDIT (MG6)"}
{"text": "Reporting to the Senior Principal Officer, Internal Audit he/she will be responsible for"}
{"text": "participating in preparation of the annual risk plan."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Plan the risk assessments comprising of preliminary surveys of processes to be"}
{"text": "reviewed, evaluation of applicable Risk Management frameworks, protocols, policies"}
{"text": "and procedures, development of risk assessment templates;"}
{"text": "• Coordinate and conduct risk and control self-assessment to ensure conformity with"}
{"text": "the Enterprise Risk Management Framework and other policies;"}
{"text": "• Participate in the review of risk assessment reports;"}
{"text": "• Organize management meetings to discuss the observations, risk exposures and"}
{"text": "recommendations;"}
{"text": "• Review and prepare the final risk assessment report, incorporating any revisions"}
{"text": "resulting from the management discussions;"}
{"text": "• Conduct continuous risk assessments and generate risk sensitization memos;"}
{"text": "• Facilitate the preparation of the Fund's risk register and evaluate the risks in relation"}
{"text": "to agreed criteria and maintaining the register based on the Enterprise Risk"}
{"text": "Management, Business Continuity and Information Security Frameworks; and"}
{"text": "• Follow up and track the progress of remediation of risk and control weaknesses"}
{"text": "identified by Risk Assessment, Internal Audit, self-testing, or controls assessment."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor's Degree in Finance, Economics, Statistics, Actuarial Science, Project"}
{"text": "Management, Business Administration or any other relevant qualification from a"}
{"text": "recognized institution;"}
{"text": "• Professional qualification in Finance, Economics, Statistics, Actuarial Science, Project"}
{"text": "management, Business Administration or any other relevant qualification from a"}
{"text": "recognized institution;"}
{"text": "• At least five (5) years’ work experience;"}
{"text": "• Membership to a relevant and accredited professional body such as ICPAK, ACCA,"}
{"text": "CFA or IIA and in good standing; and"}
{"text": "• Proficiency in computer applications."}
{"text": "PRINCIPAL OFFICE ADMINISTRATOR (MG6)"}
{"text": "Reporting to the Administration Manager, he/she will be responsible for preparing and"}
{"text": "processing documents in the office he/she is assigned to work."}
{"text": "41"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Compose correspondences for the respective Officer’s signature;"}
{"text": "• Format, proofread and assemble correspondence reports;"}
{"text": "• Arrange for photocopies and telephone ‘callbacks’ where necessary;"}
{"text": "• Screen and forward calls, re-routing calls, taking messages and schedule"}
{"text": "appointments;"}
{"text": "• Maintain the Officer’s diary, coordinate schedules of meetings, appointments, arrange"}
{"text": "meeting venues and prepare meeting files;"}
{"text": "• Manage clients’ hospitality and provide backup data as needed;"}
{"text": "• Responsible for the filing and retrieval system;"}
{"text": "• Manage office materials and stationery through purchase requisition, and manage"}
{"text": "imprest for office use;"}
{"text": "• Ensure the security of office records, equipment and documents including classified"}
{"text": "materials."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelors’ Degree in Secretarial Studies or related field from a recognized institution;"}
{"text": "• Professional qualification in Secretarial studies such as a Diploma in Secretarial"}
{"text": "Studies or Secretarial Studies Stage III;"}
{"text": "• At least five (5) years’ work experience; and"}
{"text": "• Member of an accredited professional body and in good standing;"}
{"text": "• Proficiency in computer applications."}
{"text": "PRINCIPAL MARKETING/MEMBER & CUSTOMER EXPERIENCE OFFICER (MG6)"}
{"text": "Reporting to the Senior Principal Officer, Marketing/Member Experience he/she will be"}
{"text": "responsible for aggressive and innovative marketing campaigns, including activations,"}
{"text": "media management & experiential campaigns."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Participate in brand building activities through extensive member education using"}
{"text": "media, road shows and sponsorships;"}
{"text": "• Support Customer Service initiatives to ensure customer satisfaction;"}
{"text": "• Keep inventory and oversee the distribution of marketing and sensitization materials"}
{"text": "to the branches/regions;"}
{"text": "• Support branches and regions with their marketing activities;"}
{"text": "• Participate in event management;"}
{"text": "• Draft reports after every marketing campaign;"}
{"text": "• Support the marketing and brand department on financial issues, including but not"}
{"text": "limited to drafting the departmental budget."}
{"text": "• Attend to customers through responding to their queries and providing guidance"}
{"text": "where necessary ;"}
{"text": "• Receive correspondences for the institution, sign for receipt and facilitate dispatch to"}
{"text": "the respective office or persons;"}
{"text": "42"}
{"text": "• Collect customer feedback and prepare weekly reports to help in improving"}
{"text": "products/services; and"}
{"text": "• Cross sell the Institute's products to potential and existing customers to aid the"}
{"text": "department in meeting its targets."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS"}
{"text": "• Bachelor’s Degree in Marketing, Business Administration or related field from a"}
{"text": "recognized institution;"}
{"text": "• Professional Qualification in Marketing, Business Administration or related field;"}
{"text": "• At least five (5) years’ work experience; and"}
{"text": "• Proficiency in computer applications."}
{"text": "PRINCIPAL ACCOUNTANT (MG6)"}
{"text": "Reporting to the Senior Principal Accounts Officer he/she will be responsible for"}
{"text": "examining payment documents for accuracy and completeness"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Investigate vendor account/statement reconciliation differences;"}
{"text": "• Reconcile vendor accounts and processing packed invoices in SAP;"}
{"text": "• Prepare prepayments/down payments and monitoring the ledgers;"}
{"text": "• Process PAYE and Withholding Tax and advise branches on the same;"}
{"text": "• Process staff claims and imprest and ensure accounting and reconciliation of the"}
{"text": "same"}
{"text": "• Validate and confirm collections received from branches;"}
{"text": "• Issue debit receipts and maintaining bounced cheque register;"}
{"text": "• Update income cashbook;"}
{"text": "• Support field office on revenue receipt activities;"}
{"text": "• Reconcile SAP and M-Pesa transactions;"}
{"text": "• Prepare and monitor the Fund’s Budget;"}
{"text": "• Prepare monthly quarterly and annual management reports;"}
{"text": "• Implement the performance management system;"}
{"text": "• Review annual financial statements;"}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Finance, Accounting, Economics, Commerce or related field"}
{"text": "from a recognized institution;"}
{"text": "• Professional qualification such as CPA (K), ACCA and/or CFA; Membership to a"}
{"text": "relevant and accredited professional body such as ICPAK, ACCA and/or the CFA"}
{"text": "Institute and in good standing; and"}
{"text": "• At least five (5) years’ relevant work experience; and"}
{"text": "• Proficiency in computer applications."}
{"text": "43"}
{"text": "PRINCIPAL OFFICER, INVESTIGATIONS (MG6)"}
{"text": "Reporting to the Assistant Manager, Ethics & Integrity he/she will be responsible for"}
{"text": "planning, organizing and managing investigations of alleged misconduct or alleged"}
{"text": "violations of the Fund’s internal policies and ensuring best practices."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Carry out end-to-end investigations by ensuring that all prescribed"}
{"text": "investigative/operating methodologies for the various types of investigations are"}
{"text": "adhered to and by conducting proper planning on high-level investigations;"}
{"text": "• Obtain all relevant evidence related to an investigation. Scrutinize/analyze this"}
{"text": "evidence and make meaningful observations / conclusions regarding the findings and"}
{"text": "make appropriate recommendations;"}
{"text": "• Ensure that witnesses/suspects and victims are interviewed and where necessary"}
{"text": "obtain written statements;"}
{"text": "• Compile investigation reports as per the prescribed operating methodology, containing"}
{"text": "the findings of investigations;"}
{"text": "• Ensure that each investigation has an accurate, value-adding conclusion for the type"}
{"text": "of investigation conducted; and"}
{"text": "• Make meaningful recommendations as per the type of investigation. This will include,"}
{"text": "but not limited to, system/people/process failures or internal and external threats."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Law, Finance, Business Management or a related field from a"}
{"text": "recognized institution;"}
{"text": "• Professional qualification in any of the following disciplines: Law, Finance, Business"}
{"text": "Management or a related field from a recognized institution;"}
{"text": "• At least five (5) years’ work experience; and"}
{"text": "• Proficiency in computer applications."}
{"text": "PRINCIPAL OFFICER, SUPPLY CHAIN MANAGEMENT (MG6)"}
{"text": "Reporting to the Senior Principal Officer, Supply Chain Management he/she will be"}
{"text": "responsible for evaluating tenders and writing reports."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Prepare tender documents;"}
{"text": "• Evaluate tenders & write reports;"}
{"text": "• Inspect goods, works & services and write reports;"}
{"text": "• Compel and update the list of the Fund’s vendors;"}
{"text": "• Carry out inspection and acceptance, of goods, works and services and write the"}
{"text": "reports;"}
{"text": "• Receive procurement requests from branches and file them;"}
{"text": "• Prepare requests for quotation and send invitations to vendors;"}
{"text": "• Participate in the opening, analyzing, and evaluating of quotations;"}
{"text": "44"}
{"text": "• Review the Departmental risk management matrix on a frequent basis;"}
{"text": "• Monitor, track, and report on the supply chain activities to ensure compliance and"}
{"text": "smooth running of the operations;"}
{"text": "• Monitor compliance issues to ensure compliance with relevant regulations and legal"}
{"text": "obligations affecting operations;"}
{"text": "• Participate in formulating departmental strategies, policies, plans, and budgets;"}
{"text": "• Implement risk identification and mitigation strategies for contract management;"}
{"text": "• Monitor supplier contracts and service level agreements and writing reports on"}
{"text": "adherence;"}
{"text": "• Provide support in developing a vendor rating system/matrix;"}
{"text": "• Check received items brought in by suppliers through Receipt and Dispatch;"}
{"text": "• Check the issue of items to authorized users;"}
{"text": "• Check the Stock Replenishment Document (SRD) and authorization by user"}
{"text": "department; and"}
{"text": "• Check purchase requisitions for stock items."}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelor’s Degree in Supply Chain Management, Logistics, Commerce, Business"}
{"text": "Administration, Finance, Economics, or the equivalent;"}
{"text": "• Professional Qualification in Supply Chain Management, Logistics, Commerce,"}
{"text": "Business Administration, Finance, Economics, or the equivalent;"}
{"text": "• At least five (5) years’ work experience; and"}
{"text": "• Proficiency in computer applications."}
{"text": "PRINCIPAL BENEFITS OFFICER (MG6)"}
{"text": "Reporting to the Senior Principal Officer, Benefits he/she will be responsible for ensuring"}
{"text": "proper receipting of claims from Documentation section, sorting and batching for"}
{"text": "awarding into the system;"}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Ensure Verification of benefits claims to ensure completeness and accuracy of"}
{"text": "documentation;"}
{"text": "• Coordinate award of claims in system to determine amounts payable and bank details"}
{"text": "of payee(s);"}
{"text": "• Ensure Generation of payment information reports and filing in claim files"}
{"text": "appropriately;"}
{"text": "• Oversee examination of payment information details, endorsement and dispatch"}
{"text": "claims in system to Authorization section; and"}
{"text": "• Respond to customer’s enquiries and complaints by Branch Officers/call centre or"}
{"text": "walk-in clients."}
{"text": "45"}
{"text": "JOB REQUIREMENTS/SPECIFICATIONS:"}
{"text": "• Bachelors’ Degree in any of the following disciplines: Actuarial Science; Social"}
{"text": "Sciences; Business Administration; Public Relations; Marketing or related field from a"}
{"text": "recognized institution;"}
{"text": "• Professional qualification and Membership where applicable;"}
{"text": "• At least five (5) years’ work experience; and"}
{"text": "• Proficiency in computer applications;"}
{"text": "COMPETENCIES:"}
{"text": "The competencies required for Principal Officer are as follows:"}
{"text": "• Excellent interpersonal & communication Skills"}
{"text": "• Accuracy"}
{"text": "• Organizational Skills"}
{"text": "• Customer Focus"}
{"text": "• Adaptability"}
{"text": "• Initiative, Innovation and Creativity"}
{"text": "MANAGEMENT TRAINEES (MG8)"}
{"text": "JOB PURPOSE:"}
{"text": "The trainees will join a diverse team of professionals in delivering high quality service to"}
{"text": "customers. Initially successful candidates will undergo a six (6) months intensive training"}
{"text": "in all departments in the organization. This involves inter-departmental rotation in order"}
{"text": "to develop familiarity with the organization and its functions. At the end of this period, the"}
{"text": "trainees will be evaluated for permanent employment within the organization."}
{"text": "KEY RESPONSIBILITIES:"}
{"text": "• Undertake inspection of employer records to ensure that the provisions of the"}
{"text": "NSSF ACT are complied with;"}
{"text": "• Facilitate registration of new employers, employees and voluntary contributors in"}
{"text": "collaboration with the Registration Officer;"}
{"text": "• Update and maintain zonal records including employers lists contribution registers,"}
{"text": "defaulters list, penalty and bounced cheques;"}
{"text": "• Monitor and following up on employer compliance;"}
{"text": "• Prepare inspection and zonal reports;"}
{"text": "• Carry out registration of employers, employees and voluntary contributors in"}
{"text": "collaboration with the Compliance Officers;"}
{"text": "• Validate employer returns and generating Unique Payment Numbers for"}
{"text": "receipting;"}
{"text": "• Facilitate clearance of Suspense account by establishing correct NSSF"}
{"text": "numbers;"}
{"text": "• Receive and document legitimate benefit claims applications;"}
{"text": "• Open of claim files and capturing the data into the system;"}
{"text": "46"}
{"text": "• Receive claims from Documentation section, sorting and batching for awarding"}
{"text": "into the system; and"}
{"text": "• Capture claims into the system to determine amounts payable and bank"}
{"text": "details of payee(s)."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Bachelor’s Degree from a recognized Institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ETHICS & INTEGRITY OFFICER (MG8)"}
{"text": "Reporting to Senior Ethics and Integrity Officer, the candidate will Conduct corruption risk"}
{"text": "assessments and prepare corruption mitigation plans."}
{"text": "JOB PURPOSE:"}
{"text": "• Carry out staff sensitization on corruption prevention;"}
{"text": "• Monitor compliance with ethics and integrity requirements in the Fund;"}
{"text": "• Participate in the development and review of ethics and integrity policies, strategies,"}
{"text": "processes and work procedures and plans;"}
{"text": "• Participate in corruption prevention committees (CPCs); and"}
{"text": "• Participate in corruption perception surveys."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Bachelor’s Degree in Law, Finance, Business Management or a related field from a"}
{"text": "recognized institution; and"}
{"text": "• Proficiency in computer applications."}
{"text": "ADMINISTRATION OFFICER (MG8)"}
{"text": "Reporting to the Senior Administration Officer, the candidate will assist in management"}
{"text": "of transport and office services."}
{"text": "JOB PURPOSE:"}
{"text": "• Liaise with the Senior Administration officer to ensure the renewal of applicable"}
{"text": "licenses for Fund’s fleet of motor vehicles."}
{"text": "• Liaise with the Senior Administration officer to ensure that repairs and maintenance"}
{"text": "are done and the services paid for have been delivered."}
{"text": "• Liaise with the Senior Administration officer to ensure that all Fund vehicles are"}
{"text": "insured at all times."}
{"text": "• Check reported defects of vehicles against maintenance records to confirm"}
{"text": "authenticity of defect claims and quality of repairs and maintenance services"}
{"text": "rendered."}
{"text": "• Obtain data on Fund Assets from various departments;"}
{"text": "• Prepare specifications of insurance requirements in preparation for tenders;"}
{"text": "• Coordinate the activities in Mail office and switchboard operations;"}
{"text": "47"}
{"text": "• Coordinate staff requirements, purchases & maintenance of furniture and equipment;"}
{"text": "and"}
{"text": "• Coordinate the provision of publications to Senior Management."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Bachelor’s Degree in social sciences or related field or Diploma in the above fields"}
{"text": "with Satisfactory experience; and"}
{"text": "• Proficiency in computer applications."}
{"text": "RECORDS MANAGEMENT OFFICER (MG8)"}
{"text": "Reporting to the Senior Records Officer, the candidate will Participate in the preparation,"}
{"text": "updating of file indices, conducting records surveys and appraisals."}
{"text": "JOB PURPOSE:"}
{"text": "• Prepare and implement records retention and disposal schedules;"}
{"text": "• Implement procedures for classification, maintenance, protection and disposition;"}
{"text": "• Retrieve, amalgamate files, receipt files in the register and the system;"}
{"text": "• Capture the requests, complaints and complements in the records management"}
{"text": "system (TQM, register);"}
{"text": "• Prepare and update records management system;"}
{"text": "• Search for records/files in the system for retrieval of records;"}
{"text": "• Process and index files/records to dispatch to the customers;"}
{"text": "• Sort, arrange, serialize, and return files into the shelves; and"}
{"text": "• Trace/track overdue/delayed files."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Bachelor’s degree in any of the following disciplines: Information Sciences; Records"}
{"text": "Management and Information Technology, Archives and Records Management or"}
{"text": "related field from a recognized Institution or Diploma in the above fields with"}
{"text": "satisfactory experience; and"}
{"text": "• Proficiency in computer applications."}
{"text": "FINGERPRINTS OFFICER (MG8)"}
{"text": "Reporting to the Senior Fingerprints Officer, the candidate will classify and fill fingerprint"}
{"text": "records as per their patterns and formations."}
{"text": "JOB PURPOSE:"}
{"text": "• Identify NSSF members for purposes of benefits processing;"}
{"text": "• Identify NSSF members for issuance of duplicate membership cards;"}
{"text": "• Amend member records;"}
{"text": "• Identify claimants using biometric system;"}
{"text": "• Carry out searches for members who have lost their membership numbers;"}
{"text": "• Search, extend, and give alternatives to fingerprint formulae;"}
{"text": "48"}
{"text": "• Mend and repair binders of fingerprint slips as well as impaired ones;"}
{"text": "• Arrange and label fingerprint binders for ease of filing and retrieving;"}
{"text": "• Check misfiles on lettered groups; and"}
{"text": "• Carry out on-the-job practical training for Fingerprints trainees."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Bachelor’s Degree in Forensic Science or related field from a recognized Institution.;"}
{"text": "• Fingerprints analysis and examination training Papers A, B and C; and"}
{"text": "• Proficiency in computer applications."}
{"text": "SECURITY OFFICER (MG8)"}
{"text": "Reporting to the Senior Security, the candidate will ensure Protection of NSSF property,"}
{"text": "office premises, assets, both developed and undeveloped."}
{"text": "JOB PURPOSE:"}
{"text": "• Liaise with Law Enforcement Agencies on cases affecting the organization;"}
{"text": "• Supervise and train contracted security guards on the Fund’s core security"}
{"text": "requirements;"}
{"text": "• Coordinate training of staff and other stakeholders on safety, health, security"}
{"text": "awareness;"}
{"text": "• Draft and forward investigation reports to senior officer security services;"}
{"text": "• Identify security hazards and report to officer in charge of security services;"}
{"text": "• Conduct Spot Checks to Assess/Evaluate Performance of Contracted security"}
{"text": "service providers;"}
{"text": "• Maintain incident, occurrence and confidential register;"}
{"text": "• Conduct surveillance on the Fund’s undeveloped properties to gather intelligence on"}
{"text": "potential security threats to the Fund’s assets and personnel; and"}
{"text": "• Organize the annual emergency drill and participating in the management of"}
{"text": "emergency situations."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Bachelor’s Degree in Criminology or any security-related field from a recognized"}
{"text": "institution."}
{"text": "ACCOUNTANT (MG8)"}
{"text": "Reporting to the Finance Manager in the headquarters and Branch Manager in the"}
{"text": "Branch, the candidate will be responsible for the management of Finances in the"}
{"text": "headquarters/Branch Office."}
{"text": "49"}
{"text": "JOB PURPOSE:"}
{"text": "• Sort all authorized payments for different payment modes (cash or cheques, RTGS);"}
{"text": "• Post cash payments in cash journals and print receipts;"}
{"text": "• Post cheque payments, print the cheques, stamp the documents, record in movement"}
{"text": "register and circulate for signatures;"}
{"text": "• Detach cheques, records them in their respective dispatch registers, and tag all"}
{"text": "payments with batch details;"}
{"text": "• Reconcile/ balance daily cash journal for preparation of float reimbursement;"}
{"text": "• Dispatch cheques to the vendors and disbursing cash payments;"}
{"text": "• Receive, confirm and receipt payments from employers through various modes of"}
{"text": "payment;"}
{"text": "• Balance daily collection and print summary reports;"}
{"text": "• Give feedback to customers/advising customer on issues relating to payments or"}
{"text": "documentations;"}
{"text": "• Reconcile cash and cheque contributions to bank statement;"}
{"text": "• Receive summary collections from branches electronically; and"}
{"text": "• Capture physical cheque numbers into banking system to produce bank paying slips."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Bachelor’s degree in finance, Accounting, Economics, Commerce, or related field"}
{"text": "from a recognized institution or CPA (K);"}
{"text": "• Professional qualification such as CPA (K), ACCA and/or CFA; and"}
{"text": "• Proficiency in computer applications."}
{"text": "OFFICE ADMINISTRATOR (MG8)"}
{"text": "Reporting to the General Manager/Manager/Section Head/Regional Manager the"}
{"text": "candidate will be responsible for performing all the general administrative and front office"}
{"text": "work."}
{"text": "JOB PURPOSE:"}
{"text": "• Prepare and process documents;"}
{"text": "• Compose correspondences for the respective Officer’s signature;"}
{"text": "• Format, proofread and assemble correspondence reports;"}
{"text": "• Arrange for photocopies and telephone ‘callbacks’ where necessary;"}
{"text": "• Screen and forward calls, re-route calls, take messages and schedule appointments;"}
{"text": "• Maintain the Officer’s diary, coordinate schedules of meetings, appointments,"}
{"text": "arranges meeting venues and prepares meeting files;"}
{"text": "• Manage clients’ hospitality and providing backup data as needed;"}
{"text": "• Responsible for the filing and retrieval system;"}
{"text": "• Manage office materials and stationery through purchase requisition, and manage"}
{"text": "imprest for office use; and"}
{"text": "• Ensure the security of office records, equipment and documents including classified"}
{"text": "materials."}
{"text": "50"}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Bachelors’ Degree in Secretarial Studies from a from a recognized Institution;"}
{"text": "OR"}
{"text": "• Bachelor’s Degree in any field and a Diploma in Secretarial Studies/ Secretarial"}
{"text": "course Stage III; and"}
{"text": "• Proficiency in Computer Applications."}
{"text": "COMPETENCIES:"}
{"text": "The competencies required for Management Trainees, Ethics & Integrity Officer,"}
{"text": "Administration Officer, Records Management Officer, Fingerprints Officer, Security"}
{"text": "Officer, Accountant and Office Administrator are as follows:"}
{"text": "• Ability to take & follow instructions"}
{"text": "• Technical Expertise"}
{"text": "• Customer Service orientation"}
{"text": "• Attention to detail"}
{"text": "• Excellent interpersonal & communication Skills"}
{"text": "• Adaptability"}
{"text": "• Initiative, Innovation and Creativity"}
{"text": "SENIOR ASSISTANT ACCOUNTS OFFICER (UG1)"}
{"text": "Reporting to the Accountant , the candidate will be responsible for sorting all authorized"}
{"text": "payments for different payment modes (cash, cheques or RTGS)."}
{"text": "JOB PURPOSE:"}
{"text": "• Post cash and cheque payments in respective journals and print receipts;"}
{"text": "• Detach cheques, recording them in their respective dispatch registers, and tagging all"}
{"text": "payments with batch details;"}
{"text": "• Reconcile/ balance daily cash journal for preparation of float reimbursement;"}
{"text": "• Dispatch cheques; to the vendors and disbursing cash payments;"}
{"text": "• Receive, confirm and receipt payments from employers through various modes of"}
{"text": "payment;"}
{"text": "• Balance daily collections and print summary reports;"}
{"text": "• Give feedback to customer/advise customer on issues relating to payments or"}
{"text": "documentations;"}
{"text": "• Reconcile cash and cheque contribution to bank statement;"}
{"text": "• Receive summary collections from Branches electronically; and"}
{"text": "• Capture physical cheque numbers into banking system to produce bank paying slips."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Diploma in Finance, Accounting, Economics, Commerce, or related field from a"}
{"text": "recognized institution; or CPA II; and"}
{"text": "• Proficiency in computer applications."}
{"text": "51"}
{"text": "SENIOR ASSISTANT, MARKETING/MEMBER & CUSTOMER EXPERIENCE"}
{"text": "OFFICER (UG1)"}
{"text": "Reporting to the Marketing/Member & Customer experience Officer he/she will be"}
{"text": "responsible for handling and resolving customer complaints regarding Fund"}
{"text": "products/processes."}
{"text": "JOB PURPOSE:"}
{"text": "• Answer phone calls from customers and responding to customer inquiries and"}
{"text": "complaints;"}
{"text": "• Research on required information using available resources;"}
{"text": "• Provide customers with the service and product information;"}
{"text": "• Identify, escalating priority issues and reporting to the high-level management;"}
{"text": "• Route inbound calls appropriately."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Diploma in any of the following disciplines: Public Relations, Marketing,"}
{"text": "Communication Skills, Telephone Operation, Reception & Front Office or related field"}
{"text": "from a recognized institution or Certificate in the above fields with Satisfactory"}
{"text": "experience; and"}
{"text": "• Proficiency in computer applications."}
{"text": "FINGERPRINTS ASSISTANT (UG2)"}
{"text": "Reporting to the Fingerprints Officer, the candidate the candidate will verify, confirm and"}
{"text": "carry out identification of Fingerprints for benefits’ processing."}
{"text": "JOB PURPOSE:"}
{"text": "• Identify and refer multiple claims to Benefits Records Unit for amalgamation;"}
{"text": "• Establish and refer cases of multiple registrations to the Transit & Allocation Unit for"}
{"text": "fund transfer to the effective member number or suppression of ineffective numbers;"}
{"text": "• Establish and refer Survivor benefit claims and invalid benefit claims to the Benefits"}
{"text": "Officer and the Benefits Authority respectively;"}
{"text": "• Establish and refer age/withdrawal/emigration benefit claims to the registration of"}
{"text": "employers/employees’ section for further processing; and"}
{"text": "• Establish and refer incomplete application claims to the field offices for completeness."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• Diploma in Forensic Science or related field from a recognized institution or"}
{"text": "Fingerprints analysis and examination training papers A, B and C; and"}
{"text": "• Proficiency in computer applications."}
{"text": "52"}
{"text": "COMPETENCIES:"}
{"text": "The competencies required for Senior Assistant Accounts Officer, Senior Assistant,"}
{"text": "Marketing/Member & Customer Experience Officer and Fingerprints Assistant are as"}
{"text": "follows:"}
{"text": "• Interpersonal skills;"}
{"text": "• Communication skills;"}
{"text": "• Integrity, honesty and ethics;"}
{"text": "• Attention to detail; and"}
{"text": "• Ability to build and work through teams"}
{"text": "DRIVER II (UG3)"}
{"text": "Reporting to the Administration Officer, the candidate will be responsible for driving and"}
{"text": "maintaining Fund vehicles."}
{"text": "JOB PURPOSE:"}
{"text": "• Drive Fund vehicles;"}
{"text": "• Load, unload, and perform necessary handling operations in connection with materials"}
{"text": "being transported;"}
{"text": "• Verify descriptions and quantities of all items picked up or delivered;"}
{"text": "• Maintain motor vehicles and related equipment by identifying, scheduling and/or"}
{"text": "reporting necessary repairs;"}
{"text": "• Repair minor faults and cleaning Fund vehicles;"}
{"text": "• Perform necessary clerical tasks incidental to the operation of motor vehicles and"}
{"text": "related equipment for example makes entries in the work ticket as required; and"}
{"text": "• Perform clerical duties in field offices e.g. completion of forms, taking fingerprints."}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• KCSE or its equivalent qualification;"}
{"text": "• Valid Driving License; and"}
{"text": "• At least two (2) years driving experience;"}
{"text": "OFFICE ASSISTANT II (UG4)"}
{"text": "Reporting to the Administration Officer, the candidate will be responsible for providing"}
{"text": "High Quality Cleaning & Messengerial Services in The Fund."}
{"text": "JOB PURPOSE:"}
{"text": "• Perform tasks of sweeping, dusting and vacuuming; Shampooing carpets;"}
{"text": "• Maintain safe custody of office keys during working hours;"}
{"text": "• Deliver files to designated offices;"}
{"text": "• Furnish staff with office supplies as instructed;"}
{"text": "• Ensure facilitation of opening and closing of offices; and"}
{"text": "• Deliver written and oral messages."}
{"text": "53"}
{"text": "REQUIRED QUALIFICATIONS:"}
{"text": "• KCSE or its Equivalent."}
{"text": "COMPETENCIES:"}
{"text": "The competencies required for Driver II and Office Assistant II are:"}
{"text": "• Ability to take work instructions;"}
{"text": "• Attention to detail;"}
{"text": "• Adaptability;"}
{"text": "• Work habits and attitude; and"}
{"text": "• Code of Conduct/Ethics."}
{"text": "Interested applicants are required to send a cover letter, Curriculum Vitae and copies of"}
{"text": "certificates/testimonials by hand/courier in an envelope that is clearly marked indicating"}
{"text": "the position applied for OR drop the application to the Mail Office, Social Security House,"}
{"text": "Bishops Road, Block ‘A’, Western Wing, Ground Floor by Monday ,11th December, 2023"}
{"text": "at 5.00 p.m."}
{"text": "All letters should be addressed to:"}
{"text": "The Managing Trustee/CEO"}
{"text": "National Social Security Fund"}
{"text": "P.O. Box 30599-00100"}
{"text": "NAIROBI"}
{"text": "Please note that only shortlisted candidates shall be contacted. Canvassing will"}
{"text": "lead to automatic disqualification. Candidates are advised that the Fund does not"}
{"text": "have any agents and will undertake this recruitment without charging any fees"}
{"text": "whatsoever."}
{"text": "NSSF IS AN EQUAL OPPORTUNITY EMPLOYER COMMITTED TO DIVERSITY AND"}
{"text": "GENDER EQUALITY"}